{"question": "Alex had 50 marbles in his collection. He traded some of his marbles with Jamie. Now he has 20 marbles left. How many marbles did he trade to Jamie?"}
{"question": "Maria discovered 90 stickers in her attic. She shared some of her stickers with Lily. Currently, Maria has 35 stickers. How many stickers did she share with Lily?"}
{"question": "Tom collected 120 coins during his vacation. He gave away some coins to his brother. Now he has 45 coins remaining. How many coins did he give to his brother?"}
{"question": "Lucy gathered 80 rocks from the river. She donated some rocks to her friend. After the donation, she has 30 rocks. How many rocks did she donate to her friend?"}
{"question": "Kevin found 60 toy cars at the garage sale. He sold some of the cars to his neighbor. He now has 22 toy cars left. How many toy cars did he sell?"}
{"question": "Emma picked 40 apples from her garden. She gave a few apples to her classmate. Now, she has 15 apples. How many apples did she give to her classmate?"}
{"question": "Jake had 110 baseball cards in his binder. He swapped some cards with his friend. He currently has 65 cards left. How many cards did he swap?"}
{"question": "Sophia collected 30 comic books. She lent some of her comic books to her cousin. Now she has 12 comic books remaining. How many comic books did she lend to her cousin?"}
{"question": "There were 45 apples in the basket. Sarah added more apples to the basket today. There are now 78 apples in the basket. How many apples did she add to the basket?"}
{"question": "There were 12 books on the shelf. Mark put additional books on the shelf today. There are now 30 books on the shelf. How many books did he put on the shelf?"}
{"question": "There were 60 marbles in the jar. Emily added some marbles to the jar today. There are now 90 marbles in the jar. How many marbles did she add to the jar?"}
{"question": "There were 20 ducks in the pond. Jake fed the ducks and a few more came today. There are now 35 ducks in the pond. How many ducks joined the pond?"}
{"question": "There were 100 stickers in the collection. Lisa received more stickers today. There are now 150 stickers in the collection. How many stickers did she receive?"}
{"question": "There were 18 toys in the toy box. Alex put new toys in the toy box today. There are now 40 toys in the toy box. How many toys did he put in the toy box?"}
{"question": "There were 25 plants in the garden. Rachel planted additional plants today. There are now 60 plants in the garden. How many plants did she plant?"}
{"question": "There were 75 candies in the jar. Tom added more candies to the jar today. There are now 100 candies in the jar. How many candies did he add to the jar?"}
{"question": "John is making a pie. The recipe requires 5 cups of sugar. He has already added 1 cup. How many cups does he need to add?"}
{"question": "Sarah is preparing a salad. The recipe calls for 4 cups of lettuce. She has already included 2 cups. How many more cups does she need to add?"}
{"question": "Tom is cooking rice. The recipe asks for 6 cups of water. He has already poured in 3 cups. How many cups does he still need to add?"}
{"question": "Lisa is crafting a smoothie. The recipe needs 3 cups of yogurt. She has already used 1 cup. How many cups must she add?"}
{"question": "David is brewing coffee. The recipe specifies 10 cups of water. He has already measured out 2 cups. How many cups does he still require?"}
{"question": "Emily is making soup. The recipe indicates 7 cups of broth. She has already included 2 cups. How many more cups does she need to add?"}
{"question": "Mark is roasting vegetables. The recipe requires 9 cups of chopped veggies. He has already added 4 cups. How many cups does he still need to add?"}
{"question": "Anna is whipping cream. The recipe asks for 2 cups of heavy cream. She has already poured in 0.5 cups. How many more cups does she need to add?"}
{"question": "Mark's college soccer team participated in 15 matches this season. The team triumphed in the majority of their matches. They lost 5 games. How many matches did they win?"}
{"question": "Julia's elementary school volleyball team competed in 10 games this year. They secured victories in most of their contests. They were beaten in 3 matches. How many games did they win?"}
{"question": "David's club tennis team played 20 tournaments this year. They achieved success in most of their events. They were defeated in 7 tournaments. How many tournaments did they win?"}
{"question": "Liam's university rugby team played 14 matches this season. They won the majority of the matches. They lost 6 games. How many matches did they win?"}
{"question": "Emma's community swim team entered 8 competitions this year. They came out on top in most of those events. They were defeated in 2 competitions. How many competitions did they win?"}
{"question": "Sophia's high school football team had 18 games this year. The team claimed victory in most of their matches. They lost 4 games. How many games did they win?"}
{"question": "Noah's middle school debate team participated in 6 tournaments this season. They had success in the majority of the events. They were beaten in 1 tournament. How many tournaments did they win?"}
{"question": "Isabella's summer camp basketball team played 11 games this year. They won most of their matches. They suffered defeats in 3 games. How many games did they win?"}
{"question": "There are 30 apple trees currently in the garden. Gardeners will plant apple trees today. When the gardeners are finished there will be 75 apple trees in the garden. How many apple trees did the gardeners plant today?"}
{"question": "There are 15 peach trees currently in the orchard. Farmers will plant peach trees today. When the farmers are finished there will be 50 peach trees in the orchard. How many peach trees did the farmers plant today?"}
{"question": "There are 40 cherry trees currently in the field. Workers will plant cherry trees today. When the workers are finished there will be 100 cherry trees in the field. How many cherry trees did the workers plant today?"}
{"question": "There are 10 orange trees currently in the grove. Caretakers will plant orange trees today. When the caretakers are finished there will be 35 orange trees in the grove. How many orange trees did the caretakers plant today?"}
{"question": "There are 25 maple trees currently in the park. Arborists will plant maple trees today. When the arborists are finished there will be 65 maple trees in the park. How many maple trees did the arborists plant today?"}
{"question": "There are 18 cedar trees currently in the reserve. Volunteers will plant cedar trees today. When the volunteers are finished there will be 45 cedar trees in the reserve. How many cedar trees did the volunteers plant today?"}
{"question": "There are 12 fir trees currently in the woodland. Team members will plant fir trees today. When the team members are finished there will be 38 fir trees in the woodland. How many fir trees did the team members plant today?"}
{"question": "There are 5 pine trees currently in the area. Workers will plant pine trees today. When the workers are finished there will be 20 pine trees in the area. How many pine trees did the workers plant today?"}
{"question": "Sarah had 20 apples in her basket. She went to the tree and picked more apples. Now she has 50 apples. How many did she pick?"}
{"question": "John originally had 15 bananas in his crate. He visited the farm and gathered additional bananas. He now has 40 bananas. How many did he gather?"}
{"question": "There were 12 apples in the basket. John picked some apples from his orchard. There are now 20 apples in the basket. How many apples did he pick?"}
{"question": "There were 8 books on the shelf. Sarah added some books from her collection. There are now 15 books on the shelf. How many books did she add?"}
{"question": "There were 10 cookies on the plate. Tom baked some more cookies. There are now 25 cookies on the plate. How many cookies did he bake?"}
{"question": "There were 5 cars in the parking lot. Lucy brought some cars from her garage. There are now 12 cars in the parking lot. How many cars did she bring?"}
{"question": "There were 4 fish in the aquarium. Mike introduced some fish from his pond. There are now 10 fish in the aquarium. How many fish did he introduce?"}
{"question": "There were 3 bikes in the garage. Emma purchased some bikes from the store. There are now 9 bikes in the garage. How many bikes did she purchase?"}
{"question": "There were 7 toys in the box. Kevin donated some toys to charity. There are now 13 toys in the box. How many toys did he donate?"}
{"question": "Alex attended 6 basketball games this season. He went to 10 games last season. How many basketball games did Alex attend in total?"}
{"question": "Sara watched 5 concerts this month. She attended 8 concerts last month. How many concerts did Sara watch altogether?"}
{"question": "Michael participated in 3 swimming competitions this year. He participated in 7 competitions last year. How many swimming competitions did Michael participate in in total?"}
{"question": "Emily visited 2 art galleries this week. She visited 4 galleries last week. How many art galleries did Emily visit in total?"}
{"question": "David hiked 5 trails this summer. He hiked 6 trails last summer. How many trails did David hike altogether?"}
{"question": "Linda joined 8 book clubs this season. She joined 5 clubs last season. How many book clubs did Linda join in total?"}
{"question": "Tom played 12 video games this year. He played 15 games last year. How many video games did Tom play in all?"}
{"question": "Alice has 5 red apples, and Bob has 6 red apples. How many red apples do they have in total?"}
{"question": "Mark has 12 blue marbles, while Lisa has 15 blue marbles. What is the total number of blue marbles they possess?"}
{"question": "Kevin has 7 green shirts, and Emily has 9 green shirts. How many green shirts are there altogether?"}
{"question": "John owns 4 orange bikes, and Rachel owns 10 orange bikes. What is the total number of orange bikes?"}
{"question": "Nina has 3 purple notebooks, and Leo has 5 purple notebooks. How many purple notebooks do they have combined?"}
{"question": "Sophia has 11 pink flowers, and Liam has 14 pink flowers. How many pink flowers do they have in total?"}
{"question": "Daniel has 6 white candles, and Mia has 4 white candles. How many white candles are there altogether?"}
{"question": "George has 10 brown eggs, and Anna has 7 brown eggs. What is the total number of brown eggs they have?"}
{"question": "There are 5 apple trees currently in the garden. Gardeners will plant 3 apple trees today. How many apple trees will the garden have when the gardeners are finished?"}
{"question": "Lily had 5 quarters in her purse. Her mom gave her 10 quarters. How many quarters does Lily have now?"}
{"question": "Jake had 12 nickels in his jar. His sister gave him 4 nickels. How many nickels does Jake have now?"}
{"question": "Emma had 15 pennies in her bag. Her aunt gave her 5 pennies. How many pennies does Emma have now?"}
{"question": "Oliver had 8 fifty-cent pieces in his collection. His uncle gave him 3 fifty-cent pieces. How many fifty-cent pieces does Oliver have now?"}
{"question": "Sophia had 6 one-dollar coins in her wallet. Her friend gave her 2 one-dollar coins. How many one-dollar coins does Sophia have now?"}
{"question": "Mason had 7 half dollars in his drawer. His grandfather gave him 5 half dollars. How many half dollars does Mason have now?"}
{"question": "Ava had 3 dollar bills in her wallet. Her dad gave her 9 dollar bills. How many dollar bills does Ava have now?"}
{"question": "Noah had 4 five-dollar bills in his backpack. His cousin gave him 6 five-dollar bills. How many five-dollar bills does Noah have now?"}
{"question": "James has a collection of stamps. He traded 10 with a collector. He now has 15 stamps left. How many stamps did he have to begin with?"}
{"question": "Rachel's garden had flowers. She picked 12 and gave them to her neighbor. She has 8 flowers remaining. How many flowers did she start with?"}
{"question": "Michael's video game library had titles. He sold 5 of them. Now he owns 20 games. How many games did he have at first?"}
{"question": "Sophia's bookshelf contained books. She donated 4 to a charity. She now has 22 books left. How many books were there originally?"}
{"question": "Oliver's cookie jar had cookies in it. He ate 3 cookies. He now has 17 cookies left. How many cookies did he start with?"}
{"question": "Emma's aquarium had fish. She gave away 6 fish to a friend. Now, she has 9 fish left. How many fish did she own initially?"}
{"question": "Lucas had a collection of baseball cards. He lost 2 cards in a trade. He now has 30 cards remaining. How many cards did he have originally?"}
{"question": "Nora's fruit basket had apples. She used 5 apples to make pie. She now has 10 apples left. How many apples were in the basket at the start?"}
{"question": "A bakery sold 12 cakes in the morning and 5 in the afternoon today. How many cakes were sold today?"}
{"question": "A cafe brewed 15 cups of coffee during the day and 10 in the evening today. How many cups of coffee were brewed today?"}
{"question": "A food truck served 20 tacos at lunch and 8 at dinner today. How many tacos were served today?"}
{"question": "A diner prepared 7 sandwiches for breakfast and 9 for lunch today. How many sandwiches were prepared today?"}
{"question": "A food stall sold 14 bowls of soup during the afternoon and 3 during the evening today. How many bowls of soup were sold today?"}
{"question": "A pizzeria baked 11 calzones during the day and 4 during the night. How many calzones were baked today?"}
{"question": "A food delivery service made 25 deliveries in the morning and 15 in the evening today. How many deliveries were made today?"}
{"question": "A restaurant prepared 30 salads for lunch and 10 for dinner today. How many salads were prepared today?"}
{"question": "There are 4 apples in the basket. Sarah added 5 apples to the basket. How many apples are now there in total?"}
{"question": "There are 6 books on the shelf. Mark placed 2 more books on the shelf. How many books are there in total now?"}
{"question": "There are 3 cars in the garage. John parked 2 more cars in the garage. How many cars are there now?"}
{"question": "There are 5 cookies in the jar. Lucy baked 3 more cookies and added them to the jar. How many cookies are there in total?"}
{"question": "There are 7 seats in the classroom. The teacher brought in 4 extra seats. How many seats are now in total?"}
{"question": "There are 8 balloons at the party. Emily brought 3 more balloons to the party. How many balloons are there now?"}
{"question": "There are 2 dogs in the park. Alex brought in 1 more dog to the park. How many dogs are there now?"}
{"question": "There are 9 flowers in the garden. Tom planted 2 more flowers in the garden. How many flowers are there now in total?"}
{"question": "Michael collected 5 stamps and Sarah collected 7 stamps in their stamp album. How many stamps did they collect together?"}
{"question": "Tom picked 4 apples and Lisa picked 9 apples from the orchard. How many apples did they pick altogether?"}
{"question": "Carlos found 10 rocks and Maria found 6 rocks in the park. How many rocks did they find combined?"}
{"question": "Alex read 3 books and Jamie read 5 books last month. How many books did they read together?"}
{"question": "Sam baked 12 cookies and Emma baked 8 cookies for the school event. How many cookies did they bake in total?"}
{"question": "Rob collected 15 coins and Anna collected 10 coins for her collection. How many coins did they collect together?"}
{"question": "Nina painted 4 canvases and Mark painted 9 canvases for the exhibit. How many canvases did they paint in total?"}
{"question": "Lily harvested 7 pumpkins and Jake harvested 5 pumpkins from the garden. How many pumpkins did they harvest altogether?"}
{"question": "Lisa baked 4 pies. John baked 5 pies. How many pies did they bake in total?"}
{"question": "Mia painted 7 pictures. Tom painted 2 pictures. How many pictures did they paint in total?"}
{"question": "Anna collected 3 shells. Ben collected 6 shells. How many shells did they collect in total?"}
{"question": "Julia read 5 books. Mark read 4 books. How many books did they read in total?"}
{"question": "Mike caught 2 fish. Sarah caught 9 fish. How many fish did they catch in total?"}
{"question": "Ella wrote 8 letters. Chris wrote 1 letter. How many letters did they write in total?"}
{"question": "Oliver gathered 10 stones. Ava gathered 4 stones. How many stones did they gather in total?"}
{"question": "Ryan made 3 drawings. Emma made 7 drawings. How many drawings did they make in total?"}
{"question": "Liam collected 12 marbles, Ava collected 8 marbles, and Noah collected 6 marbles at the park. How many marbles did they collect together?"}
{"question": "Emily baked 15 cookies, Jack baked 10 cookies, and Mia baked 5 cookies for the bake sale. How many cookies did they bake altogether?"}
{"question": "Mark gathered 20 apples, Sarah gathered 15 apples, and Ben gathered 10 apples from the orchard. How many apples did they gather in total?"}
{"question": "Olivia wrote 4 poems, Ethan wrote 3 poems, and Sophia wrote 2 poems for the writing contest. How many poems did they write collectively?"}
{"question": "Ryan painted 5 pictures, Zoe painted 7 pictures, and Lucas painted 3 pictures for the exhibition. How many pictures did they paint in total?"}
{"question": "Chloe raised 30 dollars, Mason raised 20 dollars, and Ava raised 10 dollars for the charity event. How much money did they raise together?"}
{"question": "Daniel read 5 books, Rebecca read 8 books, and Kevin read 4 books over the summer. How many books did they read as a group?"}
{"question": "Lisa's dog had puppies. She gave 4 to Mark and 5 to Emma. She now has 7 puppies. How many puppies did she have to start with?"}
{"question": "John's bird laid eggs. He gave 2 to Lucy and 3 to Karen. He now has 4 eggs. How many eggs did he have to start with?"}
{"question": "Sara's rabbit had bunnies. She gave 1 to Tom and 2 to Alice. She now has 5 bunnies. How many bunnies did she have to start with?"}
{"question": "Mia's turtle had hatchlings. She gave 2 to Jake and 3 to Ryan. She now has 4 hatchlings. How many hatchlings did she have to start with?"}
{"question": "Mark's horse had foals. He gave 5 to Paul and 1 to Lily. He now has 3 foals. How many foals did he have to start with?"}
{"question": "Anna's fish had fry. She gave 3 to Peter and 2 to Claire. She now has 6 fry. How many fry did she have to start with?"}
{"question": "Ella's goat had kids. She gave 4 to Sam and 1 to Rachel. She now has 4 kids. How many kids did she have to start with?"}
{"question": "Kyle's hen laid chicks. He gave 3 to Nancy and 2 to Tina. He now has 6 chicks. How many chicks did he have to start with?"}
{"question": "Mark has 12 red apples, Linda has 7 red apples, and Tom has 3 red apples. How many red apples do they have in total?"}
{"question": "Anna owns 4 green notebooks, Rachel owns 6 green notebooks, and Steve owns 8 green notebooks. How many green notebooks are there altogether?"}
{"question": "Kevin has 10 toy cars, Mike has 9 toy cars, and Sarah has 5 toy cars. What is the total number of toy cars they have?"}
{"question": "Emma possesses 3 purple dresses, Clara possesses 4 purple dresses, and Lily possesses 5 purple dresses. How many purple dresses do they have in total?"}
{"question": "John has 15 marbles, Alex has 7 marbles, and Betty has 6 marbles. How many marbles do they have combined?"}
{"question": "Lucy has 18 stamps, Anna has 11 stamps, and Jake has 9 stamps. What is the total number of stamps they own?"}
{"question": "Tim has 8 chocolate bars, Sam has 5 chocolate bars, and Rachel has 4 chocolate bars. How many chocolate bars do they have altogether?"}
{"question": "Jack had 5 quarters in his wallet. His uncle gave him 10 quarters and his sister gave him 3 quarters. How many quarters does Jack have now?"}
{"question": "Sarah had 12 nickels in her jar. Her friend gave her 7 nickels and her brother gave her 5 nickels. How many nickels does Sarah have now?"}
{"question": "Emily collected 5 apples, John collected 7 apples, and Lisa collected 4 apples from the apple tree. How many apples were collected in total?"}
{"question": "Tom gathered 6 oranges, Ava gathered 8 oranges, and Ben gathered 2 oranges from the orange grove. How many oranges were gathered in total?"}
{"question": "Rachel harvested 10 cherries, Mike harvested 3 cherries, and Anna harvested 5 cherries from the cherry tree. How many cherries were harvested in total?"}
{"question": "Kevin took 2 pears, Sophie took 11 pears, and Jake took 6 pears from the pear tree. How many pears were taken in total?"}
{"question": "Liam picked 3 bananas, Emma picked 4 bananas, and Noah picked 8 bananas from the banana bunch. How many bananas were picked in total?"}
{"question": "Sophia found 7 grapes, Liam found 5 grapes, and Mia found 6 grapes from the grapevine. How many grapes were found in total?"}
{"question": "Tom built 3 sandcastles, Jerry built 7 sandcastles, and Emily built 4 sandcastles. How many sandcastles did they build in total?"}
{"question": "Alice read 5 books, Bob read 6 books, and Charlie read 8 books. How many books did they read altogether?"}
{"question": "Mark collected 2 stamps, Lucy collected 10 stamps, and Kevin collected 5 stamps. How many stamps did they collect in total?"}
{"question": "Anna baked 6 cookies, Mike baked 3 cookies, and Sarah baked 8 cookies. How many cookies did they bake combined?"}
{"question": "Jordan drew 4 pictures, Chloe drew 5 pictures, and Liam drew 10 pictures. How many pictures did they draw in total?"}
{"question": "Nina planted 7 flowers, Tom planted 5 flowers, and Greg planted 3 flowers. How many flowers did they plant altogether?"}
{"question": "Lisa wrote 9 poems, David wrote 6 poems, and Emma wrote 4 poems. How many poems did they write in total?"}
{"question": "David has 3 hobby kits, Sarah has 7 hobby kits, and Michael has 5 hobby kits. How many hobby kits do they have in total?"}
{"question": "Anna has 30 green and 25 yellow ballons. Mark has 15 green ballons. How many green ballons do they have together?"}
{"question": "Sarah has 50 red and 20 white roses. James has 35 red roses. How many red roses do they have combined?"}
{"question": "Lisa possesses 10 orange and 40 purple crayons. Michael has 22 orange crayons. How many orange crayons do they own in total?"}
{"question": "Tom collected 32 pinecones and Lisa gathered 25 pinecones from the forest. How many pinecones did they collect together?"}
{"question": "Jake spotted 12 butterflies and Emma spotted 30 butterflies in the garden. How many butterflies did they spot together?"}
{"question": "Alex picked 21 apples and Mia picked 39 apples from the orchard. How many apples did they pick together?"}
{"question": "Ben caught 15 fish and Sarah caught 40 fish at the lake. How many fish did they catch together?"}
{"question": "John gathered 28 flowers and Kate gathered 35 flowers in the park. How many flowers did they gather together?"}
{"question": "Chris built 5 sandcastles and Anna built 17 sandcastles on the beach. How many sandcastles did they build together?"}
{"question": "There are 15 books and 25 pencils on the shelf. Sarah added 10 books to the shelf. How many books are now there in total?"}
{"question": "There are 20 apples and 50 oranges in the basket. Mike placed 5 apples in the basket. How many apples are now there altogether?"}
{"question": "There are 12 marbles and 18 balls in the jar. Lily put 6 marbles into the jar. How many marbles are now in the jar?"}
{"question": "There are 30 flowers and 12 vases on the table. John added 8 flowers to the table. How many flowers are now present in total?"}
{"question": "There are 22 cookies and 16 candies in the jar. Emma put 4 cookies in the jar. How many cookies are now in the jar?"}
{"question": "There are 10 hats and 7 scarves in the closet. Tom placed 3 hats in the closet. How many hats are now in the closet?"}
{"question": "There are 9 birds and 13 nests in the park. Anna brought 5 birds to the park. How many birds are now in the park?"}
{"question": "There are 17 toys and 27 games in the playroom. Jake added 6 toys to the playroom. How many toys are now in the playroom?"}
{"question": "Emily had 30 dimes in her jar. Her mom gave her 15 dimes. How many dimes does she have now ?"}
{"question": "Lisa collected 22 stones and Mike collected 37 stones in the park. When they sorted them, they found that 18 were broken. How many stones did they collect together?"}
{"question": "Anna gathered 30 berries and Jake gathered 25 berries in the forest. After they counted them, they realized that 5 were spoiled. How many berries did they gather together?"}
{"question": "Sophie found 50 coins and Daniel found 15 coins at the marketplace. When they cleaned them, they discovered that 10 were tarnished. How many coins did they find together?"}
{"question": "Rachel picked 12 leaves and Ben picked 27 leaves in the garden. After examining them, they saw that 7 were damaged. How many leaves did they pick together?"}
{"question": "John has 45 blue and 10 yellow marbles. Emily has 30 blue marbles. How many blue marbles do they have in total?"}
{"question": "Alex has 20 roses and 25 tulips. Jamie has 15 roses. How many roses do they have in total?"}
{"question": "Tom has 50 oranges and 15 apples. Lucy has 40 oranges. How many oranges do they have in total?"}
{"question": "Mark has 12 cats and 8 dogs. Lily has 10 cats. How many cats do they have in total?"}
{"question": "Nina has 35 pencils and 20 markers. Jake has 25 pencils. How many pencils do they have in total?"}
{"question": "John attended 24 soccer matches this season, but missed 20. He attended 8 matches last season. How many soccer matches did John attend in total?"}
{"question": "Lisa went to 40 concerts this year, but missed 30. She went to 15 concerts last year. How many concerts did Lisa go to in total?"}
{"question": "Mike participated in 50 workshops this semester, but missed 45. He participated in 12 workshops last semester. How many workshops did Mike participate in total?"}
{"question": "Sara viewed 30 art exhibitions this year, but missed 25. She viewed 10 exhibitions last year. How many art exhibitions did Sara view in total?"}
{"question": "Tom played in 22 chess tournaments this year, but missed 18. He played in 9 tournaments last year. How many chess tournaments did Tom play in total?"}
{"question": "There are 12 books and 25 magazines on the shelf. Sara added 15 books to the shelf. How many books are now there in total?"}
{"question": "There are 10 apples and 20 oranges in the basket. Mike placed 5 more apples in the basket. How many apples are now there in total?"}
{"question": "There are 50 marbles and 30 stones in the jar. Lily put in 20 more marbles. How many marbles are now there in total?"}
{"question": "There are 40 cupcakes and 60 cookies in the container. Tom baked 10 additional cupcakes. How many cupcakes are now there in total?"}
{"question": "There are 25 cars and 15 bikes in the garage. Alex brought 5 more cars into the garage. How many cars are now there in total?"}
{"question": "Mike harvested 50 tomatoes and 30 peppers. Sarah cultivated 40 tomatoes. How many tomatoes did they grow in total?"}
{"question": "Linda planted 25 radishes and 45 carrots. Tom grew 35 radishes. What is the total number of radishes they grew together?"}
{"question": "Kevin raised 60 cucumbers and 20 zucchini. Emily planted 55 cucumbers. What is the total count of cucumbers they cultivated?"}
{"question": "Rachel sowed 15 eggplants and 25 pumpkins. Henry produced 20 eggplants. How many eggplants did they grow altogether?"}
{"question": "Sophia grew 70 strawberries and 30 blueberries. Jake planted 50 strawberries. What is the combined total of strawberries they harvested?"}
{"question": "Oliver cultivated 35 beans and 45 peas. Ava harvested 40 beans. How many beans did they produce in total?"}
{"question": "Emma planted 80 onions and 60 garlic cloves. Liam grew 75 onions. How many onions did they collectively grow?"}
{"question": "Noah raised 10 leeks and 50 beets. Mia cultivated 30 leeks. What is the total number of leeks they produced together?"}
{"question": "There are 25 apple trees currently in the orchard. Gardeners will plant 30 apple trees today. How many apple trees will the orchard have when the gardeners are finished?"}
{"question": "There are 50 cherry trees currently in the garden. Landscapers will plant 20 cherry trees today. How many cherry trees will the garden have when the landscapers are finished?"}
{"question": "There are 25 apples in the basket. Sarah added 15 apples to the basket. How many apples are now there in total?"}
{"question": "There are 50 books on the shelf. Tom donated 20 books to the shelf. How many books are now there in total?"}
{"question": "There are 18 marbles in the jar. Julia put in 22 marbles into the jar. How many marbles are now there in total?"}
{"question": "There are 10 cupcakes on the table. David brought 5 more cupcakes to the table. How many cupcakes are now there in total?"}
{"question": "There are 60 stickers in the album. Emma added 30 more stickers to the album. How many stickers are now there in total?"}
{"question": "There are 12 chairs in the dining room. Ryan introduced 8 chairs to the dining room. How many chairs are now there in total?"}
{"question": "James has 25 red apples, and Sarah has 30 red apples. How many red apples do they have in total?"}
{"question": "Tom has 50 green marbles, and Lisa has 45 green marbles. How many green marbles do they have in total?"}
{"question": "Mike has 60 yellow balloons, and Emma has 55 yellow balloons. How many yellow balloons do they have in total?"}
{"question": "Anna has 12 orange candies, and Brian has 15 orange candies. How many orange candies do they have in total?"}
{"question": "Paul has 28 black pens, and Rachel has 22 black pens. How many black pens do they have in total?"}
{"question": "Kathy has 33 purple flowers, and Leo has 37 purple flowers. How many purple flowers do they have in total?"}
{"question": "Daniel has 70 silver coins, and Julia has 65 silver coins. How many silver coins do they have in total?"}
{"question": "Lisa baked 25 cookies. John baked 18 cookies. How many cookies did they bake in total?"}
{"question": "Sara read 12 books. Mike read 20 books. How many books did they read in total?"}
{"question": "Anna painted 15 pictures. Paul painted 30 pictures. How many pictures did they paint in total?"}
{"question": "Cindy grew 50 tomatoes. Mark grew 70 tomatoes. How many tomatoes did they grow in total?"}
{"question": "Rachel collected 40 stamps. Dave collected 50 stamps. How many stamps did they collect in total?"}
{"question": "Olivia wrote 10 articles. James wrote 12 articles. How many articles did they write in total?"}
{"question": "Emma harvested 22 apples. Liam harvested 28 apples. How many apples did they harvest in total?"}
{"question": "Sophia knitted 14 sweaters. Ethan knitted 36 sweaters. How many sweaters did they knit in total?"}
{"question": "Emily read 10 books this month. She read 15 books last month. How many books did Emily read in total?"}
{"question": "Jake traveled to 5 countries this year. He visited 8 countries last year. How many countries did Jake visit overall?"}
{"question": "Lisa completed 12 art projects this semester. She finished 20 projects last semester. How many art projects did Lisa complete in total?"}
{"question": "Tom collected 25 stamps and Lucy collected 35 stamps in total. How many stamps did they collect together?"}
{"question": "James picked 12 apples and Sarah picked 28 apples from the orchard. How many apples did they pick together?"}
{"question": "Alice baked 15 pies, Bob baked 22 pies, and Charlie baked 18 pies. How many pies did they bake in total?"}
{"question": "Sophia painted 12 canvases, Liam painted 25 canvases, and Noah painted 19 canvases. How many canvases did they paint in total?"}
{"question": "Emma collected 37 stamps, Oliver collected 23 stamps, and Ava collected 30 stamps. How many stamps did they collect in total?"}
{"question": "Mason harvested 45 apples, Layla harvested 28 apples, and Lucas harvested 32 apples. How many apples did they harvest in total?"}
{"question": "Isabella read 10 books, Ethan read 15 books, and Mia read 20 books. How many books did they read in total?"}
{"question": "Zoe grew 50 tomatoes, Jacob grew 35 tomatoes, and Lily grew 40 tomatoes. How many tomatoes did they grow in total?"}
{"question": "John had 15 quarters in his jar. His brother gave him 22 quarters and his sister gave him 30 quarters. How many quarters does John have now?"}
{"question": "Sara had 25 nickels in her wallet. Her friend gave her 18 nickels and her uncle gave her 27 nickels. How many nickels does Sara have now?"}
{"question": "Michael has 45 red apples, Sarah has 22 red apples, and David has 30 red apples. How many red apples do they have in total?"}
{"question": "Emma has 50 green marbles, Liam has 15 green marbles, and Noah has 25 green marbles. What is the total number of green marbles they possess?"}
{"question": "Chloe has 12 yellow flowers, Mason has 36 yellow flowers, and Lucas has 18 yellow flowers. How many yellow flowers are there altogether?"}
{"question": "Jake had 15 baseball cards. Mia gave him 30 new baseball cards. Jake purchased 10 baseball cards. How many baseball cards does Jake have now?"}
{"question": "Lily owned 22 toy cars. Tom gifted her 18 additional toy cars. Lily also bought 5 toy cars. How many toy cars does Lily possess now?"}
{"question": "Max started with 50 video game discs. His friend gave him 25 more video game discs. Max bought 15 new video game discs. How many video game discs does Max have in total?"}
{"question": "Emily had 60 stickers. Her brother gave her 30 new stickers. Emily then bought 10 more stickers. How many stickers does Emily have now?"}
{"question": "Sam had 10 comic books. Alex gave him 20 more comic books. Sam also purchased 5 comic books. How many comic books does Sam have in the end?"}
{"question": "Sarah owned 35 recipe books. Her friend gifted her 10 new recipe books. Sarah also bought 8 additional recipe books. What is the total number of recipe books Sarah has now?"}
{"question": "Emily read 10 books this month. She read 15 books last month, and plans to read 12 books next month. How many books will she read in total?"}
{"question": "Michael watched 8 movies this month. He watched 14 movies last month, and plans to watch 18 movies next month. How many movies will he watch altogether?"}
{"question": "Sarah completed 20 puzzles this month. She completed 25 puzzles last month, and plans to complete 30 puzzles next month. How many puzzles will she complete in total?"}
{"question": "David ran 12 miles this month. He ran 16 miles last month, and plans to run 20 miles next month. How many miles will he run altogether?"}
{"question": "Laura baked 5 cakes this month. She baked 10 cakes last month, and plans to bake 8 cakes next month. How many cakes will she bake in all?"}
{"question": "There are 30 books on the shelf and 12 books on the table. Lisa put 5 books on the table. How many books are there in total now?"}
{"question": "There are 25 marbles in the jar and 10 marbles in the bag. John added 8 marbles to the bag. How many marbles do we have altogether?"}
{"question": "There are 50 apples in the basket and 20 apples in the box. Sarah took 10 apples from the basket. How many apples are there now?"}
{"question": "There are 60 candies in the jar and 15 candies in the bowl. Mike placed 7 candies into the bowl. How many candies are there in total?"}
{"question": "There are 40 toys in the closet and 5 toys on the floor. Emma found 3 toys and put them on the floor. How many toys are there now?"}
{"question": "Emma collected 48 marbles from the park, and she gave Liam some of her marbles. Now, she has 30 marbles left. How many marbles did she give to Liam?"}
{"question": "Tom found 75 coins in his backyard, but he shared some with Sarah. He currently has 40 coins. How many coins did he give to Sarah?"}
{"question": "Laura picked 65 flowers in the garden and gifted some to her friend. She has 37 flowers now. How many flowers did she gift to her friend?"}
{"question": "Michael gathered 90 stickers at the event and donated some to his classmates. He has 50 stickers remaining. How many stickers did he donate?"}
{"question": "Sophie bought 100 books for her collection, but she lent some to her brother. She has 62 books now. How many books did she lend to her brother?"}
{"question": "Jake harvested 85 apples from his orchard and gave a few to his neighbors. He has 54 apples left. How many apples did he give away?"}
{"question": "Olivia received 120 cupcakes for her birthday party but shared some with her friends. Now, she has 75 cupcakes. How many cupcakes did she share?"}
{"question": "Lila got 45 dollars as a gift. She visited a toy store and purchased a doll, puzzle, and crayons. She had 20 dollars remaining, how much did she spend on the toys?"}
{"question": "Mark received 82 dollars for his graduation. He went to a bookstore and bought a novel, magazine, and bookmark. He had 45 dollars left, how much did he spend on the books?"}
{"question": "Jessica was given 50 dollars for her anniversary. She stopped by a craft store and purchased paint, brushes, and canvas. She had 15 dollars left, how much did she spend on the art supplies?"}
{"question": "Tom received 100 dollars for his birthday. He went to an electronics store and bought headphones, a charger, and a phone case. He had 40 dollars remaining, how much did he spend on the electronics?"}
{"question": "Sophia got 75 dollars for Christmas. She visited a baking supply shop and bought flour, sugar, and baking pans. She had 20 dollars left, how much did she spend on the baking supplies?"}
{"question": "James received 90 dollars as a reward. He went to a grocery store and bought fruits, vegetables, and snacks. He had 30 dollars remaining, how much did he spend on the groceries?"}
{"question": "Olivia received 60 dollars for a school project. She went to an art supply store and purchased markers, sketchpads, and paints. She had 25 dollars left, how much did she spend on the art supplies?"}
{"question": "Daniel received 80 dollars for a family event. He went to a gaming store and bought a video game, controller, and headset. He had 35 dollars left, how much did he spend on the gaming gear?"}
{"question": "There were 5 tulips in the pot. Jordan planted some tulips from his backyard. There are now 20 tulips in the pot. How many tulips did he plant?"}
{"question": "Last month Sarah had 150 dollars. She sold some old clothes and now has 220 dollars. How much money did she make selling clothes?"}
{"question": "Yesterday Mike had 50 dollars. He sold his bike and now has 90 dollars. How much money did he make from the sale of the bike?"}
{"question": "This morning Anna had 120 dollars. She babysat over the weekend and now has 180 dollars. How much money did she earn babysitting?"}
{"question": "Last week John had 200 dollars. He mowed lawns over the weekend and now has 240 dollars. How much money did he make mowing lawns?"}
{"question": "A few days ago Lucy had 30 dollars. She baked cookies for a sale and now has 70 dollars. How much money did she make from the cookie sale?"}
{"question": "Earlier this month Paul had 80 dollars. He found a lost wallet with cash and now has 100 dollars. How much money was in the wallet?"}
{"question": "Last Friday, Emma had 60 dollars. She did some odd jobs and now has 100 dollars. How much money did she make from odd jobs?"}
{"question": "There were 45 apples in the basket. Sarah added apples to the basket today. There are now 60 apples in the basket. How many apples did she add to the basket?"}
{"question": "There were 150 books on the shelf. Mark placed more books on the shelf today. There are now 200 books on the shelf. How many books did he place on the shelf?"}
{"question": "There were 25 chairs in the room. Emily brought chairs into the room today. There are now 40 chairs in the room. How many chairs did she bring into the room?"}
{"question": "There were 32 toys in the box. David put toys in the box today. There are now 50 toys in the box. How many toys did he put in the box?"}
{"question": "There were 60 candies in the jar. Lisa added candies to the jar today. There are now 85 candies in the jar. How many candies did she add to the jar?"}
{"question": "There were 100 stickers in the album. Kevin stuck more stickers in the album today. There are now 130 stickers in the album. How many stickers did he stick in the album?"}
{"question": "There were 12 fish in the aquarium. Anna added fish to the aquarium today. There are now 18 fish in the aquarium. How many fish did she add to the aquarium?"}
{"question": "Tom baked 5 cookies. Jerry baked 8 cookies. How many cookies did they bake in total?"}
{"question": "Alice collected 10 seashells. Bob collected 12 seashells. How many seashells did they collect in total?"}
{"question": "There are 10 apples on the table. Lisa brought 4 apples to the table. How many apples are now there in total?"}
{"question": "There are 5 books on the shelf. John added 2 books to the shelf. How many books are now there in total?"}
{"question": "There are 7 marbles in the jar. Sarah added 3 marbles to the jar. How many marbles are now there in total?"}
{"question": "There are 12 cookies in the jar. Mike put in 5 more cookies. How many cookies are now there in total?"}
{"question": "There are 8 toys in the box. Emma placed 6 more toys in the box. How many toys are now there in total?"}
{"question": "Sara collected 10 marbles but 3 were lost. How many marbles does Sara have now?"}
{"question": "Jake picked 8 apples but 2 were rotten. How many good apples did Jake find?"}
{"question": "Lily gathered 5 flowers but 1 wilted. How many fresh flowers does Lily have?"}
{"question": "Mark rescued 12 kittens, but 4 were sick. How many healthy kittens did Mark save?"}
{"question": "Ella found 15 coins but 5 were counterfeit. How many genuine coins did Ella find?"}
{"question": "Sam brought home 20 books, but 6 were damaged. How many intact books did Sam bring home?"}
{"question": "John collected 5 oranges and Lisa collected 6 oranges from the orange grove. How many oranges were collected in total?"}
{"question": "Tom harvested 8 apples and Anna harvested 10 apples from the apple orchard. How many apples were harvested in total?"}
{"question": "Tom has 12 red marbles but lost 3 of them. How many red marbles does Tom have now?"}
{"question": "Samantha bought 10 yellow flowers but died 4 of them. How many yellow flowers does Samantha have now?"}
{"question": "Michael owns 15 blue books but gave away 5 of them. How many blue books does Michael have now?"}
{"question": "Lisa collected 6 green stamps but misplaced 2 of them. How many green stamps does Lisa have now?"}
{"question": "David had 9 silver coins but spent 3 of them. How many silver coins does David have now?"}
{"question": "Mark's dog had 10 puppies. He gave 3 to his neighbors. How many puppies does he have now?"}
{"question": "Lisa's rabbit had 5 babies. She sold 1 to a friend. How many babies does she have now?"}
{"question": "Tom's fish had 7 fry. He released 2 into the pond. How many fry does he have now?"}
{"question": "Cynthia's bird laid 4 eggs. She gave 1 to her sister. How many eggs does she have now?"}
{"question": "Paul's turtle had 6 hatchlings. He gave 2 to a pet store. How many hatchlings does he have now?"}
{"question": "Sarah's goat had 9 kids. She sold 3 at the market. How many kids does she have now?"}
{"question": "There are 35 apples in the basket. Mark added 20 apples to the basket. How many apples are now there in total?"}
{"question": "There are 50 books on the shelf. Emily donated 15 books to the shelf. How many books are now there in total?"}
{"question": "There are 12 cookies on the plate. John baked 18 cookies and placed them on the plate. How many cookies are now there in total?"}
{"question": "There are 22 marbles in the jar. Sarah found 10 more marbles and put them in the jar. How many marbles are now there in total?"}
{"question": "Emily collected 50 marbles from the park, she gifted 20 of the marbles to Max. How many marbles does she have left?"}
{"question": "Michael gathered 40 apples from the orchard, he donated 15 of the apples to the food bank. How many apples does he still possess?"}
{"question": "Lisa picked 25 flowers from the garden, she gave 10 of the flowers to her friend. How many flowers does she retain?"}
{"question": "John found 60 coins on the street, he spent 25 of the coins on snacks. How many coins does he currently hold?"}
{"question": "Anna grabbed 30 cookies from the jar, she shared 12 of the cookies with her siblings. How many cookies does she have remaining?"}
{"question": "Tom collected 45 stickers from various places, he traded 22 of the stickers with his classmates. How many stickers does he have now?"}
{"question": "Lisa had 95 stickers. John took 25 of Lisa's stickers. How many stickers does Lisa have now?"}
{"question": "Tom owns 62 coins. Alex purchased 18 of Tom's coins. How many coins does Tom have left?"}
{"question": "Sara has 45 marbles. David bought 10 of Sara's marbles. How many marbles does Sara have now?"}
{"question": "Jake possessed 72 trading cards. Olivia acquired 20 of Jake's trading cards. How many trading cards does Jake have remaining?"}
{"question": "Emma had 54 toy cars. Noah received 15 of Emma's toy cars. How many toy cars does Emma have now?"}
{"question": "There are 30 pencils in the case. Maria added 15 pencils to the case. How many pencils are there in total now?"}
{"question": "There are 75 books on the shelf. John brought 25 more books to the shelf. How many books are there altogether?"}
{"question": "There are 48 chairs in the hall. Sarah brought 12 more chairs into the hall. What is the total number of chairs now?"}
{"question": "There are 60 toys in the box. Alex put 20 new toys in the box. How many toys are there in all now?"}
{"question": "There are 90 cookies on the plate. Emma baked 30 additional cookies. How many cookies do we have now?"}
{"question": "There are 17 plants in the garden. Tim added 8 more plants to the garden. How many plants are there in total?"}
{"question": "There are 25 cupcakes in the bakery. Lucy decorated 10 more cupcakes. How many cupcakes are there in total now?"}
{"question": "There are 40 cars in the parking lot. Dave parked 10 more cars in the parking lot. What is the total number of cars now?"}
{"question": "Lisa baked 45 cookies and gave 30 of the cookies to her friends. How many cookies does she have left?"}
{"question": "Tom collected 120 baseball cards, and he traded 50 cards with his buddy. How many cards does Tom still possess?"}
{"question": "Emma read 15 books this month, but she lent 5 books to her sister. How many books does Emma have now?"}
{"question": "David had 67 marbles and he lost 22 marbles during the game. How many marbles does David have remaining?"}
{"question": "Sarah bought 88 stickers and she gave away 36 stickers to her classmates. How many stickers does Sarah keep?"}
{"question": "Annie discovered 52 rocks at the park, then she donated 20 rocks to the local museum. How many rocks does Annie retain?"}
{"question": "Kevin wrote 90 pages of a book and submitted 40 pages to a publisher. How many pages does Kevin still have unpublished?"}
{"question": "Jessica baked 245 cookies. Mark baked 167 cookies. How many cookies did they bake together?"}
{"question": "Sarah collected 58 shells. Tim collected 73 shells. What is the total number of shells they collected?"}
{"question": "Liam read 99 books. Emma read 85 books. How many books did they read in total?"}
{"question": "Anna painted 40 canvases. David painted 55 canvases. What is the combined total of canvases they painted?"}
{"question": "Kevin wrote 120 articles. Megan wrote 90 articles. What is the total number of articles they wrote?"}
{"question": "Tom built 32 models. Lisa built 47 models. How many models did they build together?"}
{"question": "Rachel harvested 150 apples. John harvested 200 apples. How many apples did they harvest in total?"}
{"question": "Sophie knitted 65 scarves. Ben knitted 75 scarves. What is the total number of scarves they knitted together?"}
{"question": "Emily had 500 baseball cards. Rachel purchased 150 of Emily's baseball cards. How many baseball cards does Emily have left?"}
{"question": "Sam owns 300 video games. Kelly acquired 75 of Sam's video games. What is the number of video games Sam possesses now?"}
{"question": "Julia has 845 red marbles, she gave Tom 307 of the marbles. How many red marbles does she now have?"}
{"question": "Mike owns 532 toy cars, he gifted Sarah 145 of the cars. How many toy cars does he have left?"}
{"question": "Jessica holds 624 silver coins, she transferred 178 of the coins to Alex. How many silver coins does she currently possess?"}
{"question": "David has 920 stickers, he shared 369 of the stickers with Lily. How many stickers does he retain?"}
{"question": "Emily collected 377 seashells, she donated 89 of the seashells to the school. How many seashells does she still have?"}
{"question": "There are 85 books on the shelf. John added 15 more books to the shelf. How many books are there now in total?"}
{"question": "There are 50 marbles in the box. Emily put 30 marbles into the box. What is the total number of marbles now?"}
{"question": "There are 200 stickers in the album. Michael added 50 stickers to the album. How many stickers are there altogether?"}
{"question": "There are 73 candies in the jar. Nina placed 27 candies in the jar. What is the total number of candies now?"}
{"question": "Emily has 5 marbles. Alex took 3 of Emily's marbles. How many marbles does Emily have now?"}
{"question": "Liam owns 4 video games. Mia purchased 1 of Liam's video games. How many video games does Liam have now?"}
{"question": "There are 3 apple trees currently in the garden. Gardeners will plant 5 apple trees today. How many apple trees will the garden have when the gardeners are finished?"}
{"question": "There are 4 rose bushes currently in the yard. Yard workers will plant 6 rose bushes today. How many rose bushes will the yard have when the workers are finished?"}
{"question": "There are 2 cherry trees currently in the orchard. Orchard caretakers will plant 3 cherry trees today. How many cherry trees will the orchard have when the caretakers are finished?"}
{"question": "There are 1 lemon tree currently in the grove. Grove staff will plant 7 lemon trees today. How many lemon trees will the grove have when the staff are finished?"}
{"question": "There are 5 tulip plants currently in the flower bed. Flower bed caretakers will plant 4 tulip plants today. How many tulip plants will the flower bed have when the caretakers are finished?"}
{"question": "Lisa baked 7 pies, but the kids ate 5 pies. How many pies does Lisa have?"}
{"question": "Tom planted 10 trees, but the deer damaged 4 trees. How many trees does Tom have left?"}
{"question": "Emily prepared 6 sandwiches, but the friends took 2 sandwiches. How many sandwiches does Emily have now?"}
{"question": "Emily had marbles. She gave 5 to her cousin. She now has 10 marbles left. How many marbles did she have to start with?"}
{"question": "Marcus had books. He donated 12 to the library. He currently has 8 books remaining. How many books did he initially have?"}
{"question": "Tom baked 4 pies. Sarah baked 7 pies. How many pies did they bake altogether?"}
{"question": "Emma read 5 books. Liam read 8 books. How many books did they read in total?"}
{"question": "Mark painted 10 fences. Laura painted 3 fences. How many fences did they paint combined?"}
{"question": "Nina collected 12 seashells. Jake collected 15 seashells. How many seashells did they collect in all?"}
{"question": "Olivia made 14 cupcakes. Fiona made 9 cupcakes. How many cupcakes did they make together?"}
{"question": "Aaron caught 6 fish. Sophie caught 11 fish. How many fish did they catch altogether?"}
{"question": "Michael sold 5 cars. Rebecca sold 4 cars. How many cars did they sell in total?"}
{"question": "David gathered 8 eggs. Grace gathered 7 eggs. How many eggs did they gather together?"}
{"question": "Liam baked 8 cookies. Emma baked 5 cookies. How many cookies did they bake in total?"}
{"question": "Jessica planted 10 flowers. Mark planted 7 flowers. How many flowers did they plant altogether?"}
{"question": "Tom read 3 books. Sarah read 6 books. How many books did they read combined?"}
{"question": "Anna collected 12 stickers. Mike collected 9 stickers. How many stickers did they collect in all?"}
{"question": "John has 10 marbles. Sarah took 4 of John's marbles. How many marbles does John have now?"}
{"question": "Alice has 8 stickers. Michael collected 2 of Alice's stickers. How many stickers does Alice have now?"}
{"question": "Tom had 10 apples in the orchard. The birds took away 4 of the apples. How many apples does Tom now have?"}
{"question": "Sarah had 5 oranges in the basket. The children picked 2 of the oranges. How many oranges does Sarah now have?"}
{"question": "John had 12 cookies in the jar. His friends ate 6 of the cookies. How many cookies does John now have?"}
{"question": "Alice had 7 bananas in the fruit bowl. The dog stole 3 of the bananas. How many bananas does Alice now have?"}
{"question": "Mark had 15 marbles in the bag. He lost 5 of the marbles. How many marbles does Mark now have?"}
{"question": "A bakery baked 12 loaves of bread for breakfast. Only 5 were sold. How many loaves were left over from breakfast?"}
{"question": "A chef prepared 15 pasta dishes for dinner. Only 7 were ordered. How many pasta dishes were remaining after dinner?"}
{"question": "A pizza shop made 20 pizzas for a party. Only 10 were eaten. How many pizzas were left over after the party?"}
{"question": "A cafe brewed 10 pots of coffee for the morning rush. Only 4 were consumed. How many pots of coffee were still available after the rush?"}
{"question": "A grillmaster cooked 25 chicken wings for a game night. Only 11 were enjoyed. How many chicken wings were left over after the game?"}
{"question": "A deli prepared 18 sandwiches for a picnic. Only 9 were taken. How many sandwiches were left over after the picnic?"}
{"question": "There are 10 apples in the basket. John ate 4 apples from the basket. How many apples are there now?"}
{"question": "There are 15 books on the shelf. Sarah removed 5 books from the shelf. How many books are there now?"}
{"question": "Emily gathered 12 apples and shared 5 of the apples with John. How many apples does Emily have now?"}
{"question": "Mark collected 15 oranges and gave 6 of the oranges to Lisa. How many oranges does Mark possess now?"}
{"question": "Julia harvested 20 berries and handed 8 of the berries to Tom. How many berries does Julia retain now?"}
{"question": "Chris found 10 cherries and provided 3 of the cherries to Alex. How many cherries does Chris hold now?"}
{"question": "Michael has 15 red apples but gave away 4 of them. How many red apples does Michael have now?"}
{"question": "Sarah bought 12 green marbles but lost 3 of them. How many green marbles does Sarah have now?"}
{"question": "Tom has 20 yellow stickers but used 7 of them. How many yellow stickers does Tom have now?"}
{"question": "Lisa had 8 purple flowers but picked 2 of them. How many purple flowers does Lisa have now?"}
{"question": "David owns 6 orange toy cars but broke 1 of them. How many orange toy cars does David have now?"}
{"question": "Sarah has 25 red apples, she gave Mark 10 of the apples. How many red apples does she now have?"}
{"question": "John has 40 green marbles, he sold 15 of the marbles. How many green marbles does he have left?"}
{"question": "Emily has 50 orange oranges, she donated 20 of the oranges. How many orange oranges does she still have?"}
{"question": "David has 15 blue shirts, he lent 5 of the shirts. How many blue shirts does he remain with?"}
{"question": "Lisa has 60 pink flowers, she gave away 30 of the flowers. How many pink flowers does she have now?"}
{"question": "Lisa has 50 stamps. Tom collected 15 of Lisa's stamps. How many stamps does Lisa have now?"}
{"question": "There are 60 pencils in the box. Maria took 15 pencils from the box. How many pencils are now in the box?"}
{"question": "There are 100 books on the shelf. Jake borrowed 30 books from the shelf. How many books are left on the shelf?"}
{"question": "There are 80 candies in the jar. Lucy ate 25 candies from the jar. How many candies remain in the jar?"}
{"question": "There are 50 toys in the toy chest. Sam gave away 20 toys from the toy chest. How many toys are still in the toy chest?"}
{"question": "There are 70 stamps in the album. Alex traded 10 stamps from the album. How many stamps are now in the album?"}
{"question": "There are 90 fruits in the basket. Emma picked 30 fruits from the basket. How many fruits are left in the basket?"}
{"question": "There are 40 notebooks in the drawer. John used 10 notebooks from the drawer. How many notebooks are remaining in the drawer?"}
{"question": "There are 120 marbles in the bag. Kevin lost 35 marbles from the bag. How many marbles are now in the bag?"}
{"question": "Mia bought a puzzle for $3.50 and a board game for $7.45. How much did Mia spend on games?"}
{"question": "Mark purchased a soccer ball for $12.99 and a basketball for $15.30. What was the total amount Mark spent on sports equipment?"}
{"question": "John ordered pizza for dinner. John spent $12.50 on a large pizza and $3.75 on a soda. What was the total of the dinner bill?"}
{"question": "Emily grabbed coffee for breakfast. Emily spent $4.10 on a cappuccino and $2.50 on a muffin. What was the total of the breakfast bill?"}
{"question": "Michael bought snacks for the movie. Michael spent $7.00 on popcorn and $5.00 on a drink. What was the total of the snack bill?"}
{"question": "Linda had brunch at a café. Linda spent $8.25 on a sandwich and $4.95 on a smoothie. What was the total of the brunch bill?"}
{"question": "David picked up tacos for dinner. David spent $9.50 on tacos and $2.80 on chips. What was the total of the dinner bill?"}
{"question": "Jessica went to a bakery for a treat. Jessica spent $3.60 on a pastry and $2.40 on coffee. What was the total of the bakery bill?"}
{"question": "Robert ordered sushi for lunch. Robert spent $11.00 on sushi rolls and $2.50 on miso soup. What was the total of the lunch bill?"}
{"question": "Alice bought a puzzle for $8.50, a board game for $15.75, and a card game for $6.00. How much did Alice spend on games?"}
{"question": "Mike ordered a racing game for $20.99, a shooting game for $15.40, and a role-playing game for $22.10. What was the total amount Mike spent on video games?"}
{"question": "A truck carries 4500 kilograms of supplies. At a loading dock, workers add 3200 kilograms more to the truck. How many kilograms of supplies does the truck have now?"}
{"question": "A warehouse contains 3200 boxes of goods. During a sale, employees add 1500 boxes to the inventory. What is the total number of boxes in the warehouse now?"}
{"question": "A spacecraft has 7500 liters of fuel on board. After a refueling stop, technicians add 2300 liters more. How many liters of fuel does the spacecraft have in total?"}
{"question": "A freight train is loaded with 9800 tons of coal. At a station, workers load an additional 1200 tons onto the train. What is the total weight of coal on the train now?"}
{"question": "A cargo plane begins its flight with 5000 kilograms of freight. After a stop, it picks up another 4000 kilograms. How much freight is the cargo plane carrying now?"}
{"question": "An oil tanker starts with 15000 barrels of oil. It receives an additional 6500 barrels during the trip. How many barrels of oil does the tanker hold now?"}
{"question": "A bus can carry 300 passengers. Before departure, more travelers are allowed onboard, adding 50 more passengers. What is the total number of passengers on the bus now?"}
{"question": "A container holds 2800 liters of water. After refilling, 1200 liters are added to it. How many liters of water are in the container now?"}
{"question": "Before November, shoppers purchase 2100 winter jackets from the store. During November, they buy 4500, and there are none left. In total, how many winter jackets do the shoppers purchase?"}
{"question": "Prior to January, clients buy 800 pairs of boots from the shop. Throughout January, they acquire 3300, and the stock runs out. Overall, how many pairs of boots do the clients buy?"}
{"question": "Before February, patrons acquire 1200 scarves from the boutique. During February, they get 5200, and there are no more available. In total, how many scarves do the patrons acquire?"}
{"question": "Before March, customers buy 1800 beanies from the outlet. In March, they purchase 7600, and there are zero left. Altogether, how many beanies do the customers buy?"}
{"question": "Before April, buyers get 950 gloves from the shop. During April, they obtain 4320, and there are none remaining. How many gloves do the buyers get in total?"}
{"question": "Prior to May, people purchase 1750 raincoats from the store. In May, they buy 3000, and the inventory is depleted. How many raincoats do the people purchase in total?"}
{"question": "Before June, consumers buy 2200 hats from the market. Throughout June, they acquire 6600, and there are none left after that. How many hats do the consumers buy altogether?"}
{"question": "Before July, residents spend on 1300 umbrellas from the shop. During July, they purchase 5000, and there are none available anymore. In sum, how many umbrellas did the residents buy?"}
{"question": "Linda is a gardener. Last year, she grew 1520 tomatoes. This year, she added new techniques and increased her tomato yield by 3640 tomatoes. How many tomatoes did Linda grow this year?"}
{"question": "Tom is a baker. Last year, he made 3200 loaves of bread. This year, he acquired new equipment and increased his bread production by 4800 loaves. How many loaves of bread did Tom make this year?"}
{"question": "Sara is a painter. Last year, she created 150 paintings. This year, she attended workshops and increased her painting output by 250 paintings. How many paintings did Sara create this year?"}
{"question": "Mark is a farmer. Last year, he harvested 5400 apples. This year, he expanded his orchard and increased his apple harvest by 2200 apples. How many apples did Mark harvest this year?"}
{"question": "Emily is a writer. Last year, she wrote 120 chapters. This year, she joined a writing group and increased her chapters by 180 chapters. How many chapters did Emily write this year?"}
{"question": "John is a musician. Last year, he composed 36 songs. This year, he took music lessons and increased his song count by 48 songs. How many songs did John compose this year?"}
{"question": "Rachel is a chef. Last year, she prepared 764 dishes. This year, she learned new recipes and increased her dish preparation by 1120 dishes. How many dishes did Rachel prepare this year?"}
{"question": "Kevin is a sculptor. Last year, he completed 34 sculptures. This year, he took part in workshops and increased his sculpture output by 16 sculptures. How many sculptures did Kevin complete this year?"}
{"question": "A water tank had a crack. Before workers could start the repair, 3200 liters of water spilled out. While the workers made the repairs, another 2500 liters of water leaked. In total, how many liters of water escaped from the tank?"}
{"question": "A gas line burst in a facility. Before technicians could address the issue, 1450 liters of gas escaped. During the repairs, an additional 900 liters were released. How many liters of gas were lost altogether?"}
{"question": "A sewer line was damaged during construction. Before maintenance crew arrived, 7800 liters of sewage poured out. While the crew worked, 6200 liters leaked further. What is the total amount of sewage that leaked?"}
{"question": "An ink pipe in a factory ruptured. Before the team could intervene, 540 liters of ink leaked. While they were fixing it, another 450 liters escaped. What is the overall volume of ink that was lost?"}
{"question": "A chemical tank developed a leak. Before the emergency response team could act, 1100 liters of chemicals leaked into the environment. While they worked on containment, an additional 850 liters spilled. How many liters of chemicals leaked in total?"}
{"question": "A coolant line in a machine broke. Before engineers could initiate repairs, 700 liters of coolant leaked out. While they were handling the situation, 500 liters leaked further. What is the total amount of coolant that leaked?"}
{"question": "An oil drilling rig malfunctioned. Before crews could arrive, 9000 liters of oil flowed into the ocean. While they worked on rectifying the situation, another 7500 liters leaked. What was the total volume of oil that ended up in the water?"}
{"question": "A food processing plant faced a spillage. Before the cleanup could begin, 450 liters of oil product leaked. During the cleanup, 350 liters more spilled out. How many liters of product were released in total?"}
{"question": "A toy factory manufactured 1523 toys in the United States and 1080 toys in Canada. How many toys did they produce in total?"}
{"question": "A bakery sold 1230 pastries in the morning and 940 pastries in the afternoon. What is the total number of pastries sold?"}
{"question": "An electronics company shipped 4200 smartphones in Asia and 3100 smartphones in Europe. How many smartphones did they ship in total?"}
{"question": "A book publisher released 765 new titles in North America and 642 new titles in the UK. What is the total number of new titles released?"}
{"question": "A vineyard produced 5000 bottles of wine in California and 3500 bottles of wine in France. How many bottles of wine were produced altogether?"}
{"question": "Liam's family relocated from Canada to Australia, so they had to exchange their currency for Australian dollars. Their checking account now holds 4500 AUD and their savings account contains 2500 AUD. How much money do they possess in total?"}
{"question": "Maria's family moved from Brazil to Spain, which required them to convert their currency into euros. Their checking account currently has 5320 euros and their savings account has 2100 euros. What is their total amount in euros?"}
{"question": "Jamal's family transitioned from Nigeria to the United States, necessitating a currency exchange to US dollars. Their checking account reflects 7000 USD while their savings account shows 4000 USD. How many dollars do they have altogether?"}
{"question": "Aisha's family migrated from India to the UK, so they needed to convert their funds into British pounds. Their checking account at present has 6000 GBP and their savings account has 3500 GBP. How many pounds do they have in total?"}
{"question": "Carlos's family shifted from Mexico to Germany, which required them to convert their pesos to euros. Their checking account has 5200 euros and their savings account has 2800 euros. How much money do they have combined in euros?"}
{"question": "Sophia's family journeyed from Italy to New Zealand, leading them to exchange their euros for New Zealand dollars. Their checking account now shows 4500 NZD and their savings account contains 1500 NZD. What is their total in dollars?"}
{"question": "Noah's family moved from Sweden to Singapore, requiring them to convert their currency into Singapore dollars. Their checking account has 5000 SGD and their savings account holds 3500 SGD. What is their total amount in SGD?"}
{"question": "Emma's family transitioned from Russia to Thailand, which meant they had to exchange their rubles for Thai baht. Their checking account now has 8000 baht and their savings account contains 2000 baht. How much baht do they have all together?"}
{"question": "There are 3427 cars in the city of Maplewood. Additionally, there are 2489 cars in its surrounding towns. What is the total number of cars in Maplewood and its towns?"}
{"question": "There are 1234 laptops in the university's library. Furthermore, there are 5678 laptops in the campus computer labs. How many laptops do the university's facilities have in total?"}
{"question": "Initially, there were 15000 cars in the town. After a sale, 25000 more cars were added. How many cars are there now in the town?"}
{"question": "There were 5000 students enrolled in the school last year. This year, 12000 new students registered. What is the total number of students now?"}
{"question": "The library had 35000 books before the donation. With a recent contribution of 15000 books, how many books are now in the library?"}
{"question": "The park had 100 benches originally. Following renovations, workers installed 400 additional benches. Now, how many benches are in the park?"}
{"question": "At the start of the year, there were 7000 bicycles in the city. With a recent influx of 3000 bicycles, what is the new total?"}
{"question": "A community center had 200 members last month. This month, 500 new members joined. How many members are there now at the community center?"}
{"question": "The museum contained 1800 artifacts before the acquisition. After receiving a new collection of 600 artifacts, how many artifacts are in the museum now?"}
{"question": "There were originally 2500 trees planted in the area. After a reforestation project, 10000 new trees were added. How many trees are in the area now?"}
{"question": "A gardener predicts that she will collect 32000 tomatoes. The weather conditions are ideal during the growing period, so she gathers 450 tomatoes more than anticipated. How many tomatoes does the gardener collect?"}
{"question": "An orchard owner thinks he will yield 15000 apples. Due to excellent weather this season, he ends up harvesting 300 apples more than he expected. How many apples does the orchard owner harvest?"}
{"question": "A vine grower estimates that he will produce 24000 grapes. With optimal weather throughout the cultivation, he ends up producing 500 grapes more than he planned. How many grapes does the vine grower produce?"}
{"question": "A fish farmer expects to catch 2000 pounds of trout. Since the conditions are perfect, he catches 100 pounds more than he predicted. How many pounds of trout does the fish farmer catch?"}
{"question": "A flower cultivator anticipates that he will bloom 15000 roses. With the weather being just right, he ends up having 200 roses more than he expected. How many roses does the flower cultivator bloom?"}
{"question": "A dairy farmer predicts he will milk 8500 gallons of milk. Thanks to favorable conditions, he milks 150 gallons more than expected. How many gallons of milk does the dairy farmer produce?"}
{"question": "Emily recently withdrew $45 from her savings account. Consequently, the account balance is now $1,855. How much money did she have before the withdrawal?"}
{"question": "Michael just paid $150 for his utility bill. As a result, his bank account now has $2,200 left in it. What was the balance in the account prior to the payment?"}
{"question": "Sarah transferred $85 from her checking account. Now, her account shows a balance of $3,415. How much money did she have before the transfer?"}
{"question": "David just made a purchase of $120 from his account. Now, it reflects $500. What was the amount in his account before the transaction?"}
{"question": "Jessica withdrew $30 from her account yesterday. As a result, her current balance is $734. How much did she have in her account prior to the withdrawal?"}
{"question": "Last year at Springfield's train station, 12345 travelers arrived on schedule. Sadly, 178 travelers arrived late. In total, how many travelers arrived at Springfield last year?"}
{"question": "Last year at Maplewood's bus terminal, 9876 passengers reached their destination on time. Regrettably, 45 passengers experienced delays. In total, how many passengers used the bus terminal in Maplewood last year?"}
{"question": "Last year at Cedar Fall's ferry port, 23456 tourists docked right on time. Unfortunately, 89 tourists faced delays. How many tourists arrived at Cedar Falls last year in total?"}
{"question": "Last year at Riverdale's airport, 15000 flights arrived as scheduled. Unfortunately, 300 flights were delayed. In total, how many flights landed in Riverdale last year?"}
{"question": "Last year at Georgetown's harbor, 21000 ships docked without any issues. Unfortunately, 125 ships faced delays. How many ships arrived at Georgetown last year in total?"}
{"question": "Last year at Hilltown's railway station, 45000 commuters arrived on time. Unfortunately, 750 commuters arrived late. How many commuters used the railway station in Hilltown last year in total?"}
{"question": "Last year at Lakeside's bus depot, 30200 passengers departed on schedule. Sadly, 180 passengers had delayed departures. How many passengers departed from Lakeside last year in total?"}
{"question": "Last year at Rivertown's airport, 17500 passengers arrived on schedule. Unfortunately, 250 passengers landed late. What was the total number of passengers that arrived at Rivertown last year?"}
{"question": "A wildfire spreads across the forest. It burns 25200 acres of the forest, but leaves 1500 acres unburned. How many acres does the forest cover?"}
{"question": "A flood ravages the valley. It engulfs 15000 acres of the valley in water, but leaves 300 acres dry. How many acres does the valley cover?"}
{"question": "A blizzard blankets the landscape. It coats 38000 acres of the land in snow, but leaves 600 acres clear. How many acres does the landscape cover?"}
{"question": "A hurricane batters the coast. It affects 42000 acres of the coastline, but spares 800 acres. How many acres does the coastline cover?"}
{"question": "A military training exercise impacts the range. It occupies 50000 acres of the range, but avoids 250 acres. How many acres does the range cover?"}
{"question": "A new development project takes over the land. It covers 30000 acres of the land in buildings, but leaves 1000 acres untouched. How many acres does the land cover?"}
{"question": "An invasive species spreads through the wetlands. It overtakes 7500 acres of the wetlands, but leaves 200 acres unaffected. How many acres do the wetlands cover?"}
{"question": "A mining operation expands in the mountains. It exploits 60000 acres of the mountains, but leaves 1000 acres intact. How many acres do the mountains cover?"}
{"question": "A region is infested by a certain kind of rats. To combat this, the farmer introduces 2500 traps and 7200 baits into the area. How many traps and baits are there in total?"}
{"question": "An orchard is suffering from a disease caused by a specific fungus. To fight back, a gardener plants 3000 resistant trees and uses 15000 fungicide sprays. What is the total number of trees and sprays?"}
{"question": "A vineyard is being attacked by a swarm of locusts. In retaliation, a vineyard owner releases 4500 drones to monitor the area and 8000 traps to capture them. What is the total count of drones and traps?"}
{"question": "A greenhouse is plagued by caterpillars. In response, the owner introduces 2000 birds to eat the pests and places 5000 sticky traps around. How many birds and traps are there combined?"}
{"question": "A farm faces a sudden influx of grasshoppers. As a measure, the farmer scatters 1000 nets around and uses 6000 liters of pesticide. How many nets and liters of pesticide are there altogether?"}
{"question": "A garden is under attack from slugs. In defense, the gardener sets up 3500 barriers and spreads 7500 granules to deter them. What is the total number of barriers and granules?"}
{"question": "A field is being overrun by beetles. Consequently, the farmer plants 4000 repellent plants and applies 2000 gallons of a special spray. How many repellent plants and gallons of spray are there together?"}
{"question": "A lawn faces a problem with weeds. To handle this, the caretaker drops 600 seeds of native plants and spreads 3000 pounds of mulch. What is the combined number of seeds and pounds of mulch?"}
{"question": "Last year, 75234 people were born in a city, and 12456 people moved there. How many new residents joined the city last year?"}
{"question": "In a town, 50000 children were born last year, and 20000 adults relocated to it. What was the total number of new inhabitants in the town last year?"}
{"question": "Last year, 120000 individuals were born in a state, while 30000 people immigrated. How many new people started living in the state last year?"}
{"question": "Last year, 85000 babies were born in a region, and 15000 people migrated to it. What is the total number of new residents in the region last year?"}
{"question": "A province saw 43000 births last year and received 21000 immigrants. How many new individuals began living in the province last year?"}
{"question": "In a nation, 92000 newborns were recorded last year, alongside 18000 newcomers from abroad. How many fresh residents were added to the nation last year?"}
{"question": "Last year, 67000 people were born in a county, and 12000 people came to live there. How many new people began residing in the county last year?"}
{"question": "A truck loaded with apples tips over on the highway. By the time the truck is uprighted, 34567 pounds of apples have fallen onto the road. Only 1234 pounds of apples remain in the truck. How many pounds of apples did the truck originally carry?"}
{"question": "A train full of coal derails near a station. By the time the train is repaired, 56789 tons of coal have spilled onto the tracks. Only 432 tons of coal remain in the train. How many tons of coal did the train originally have?"}
{"question": "A plane with luggage crashes shortly after takeoff. By the time the plane is recovered, 12345 bags of luggage have been lost. Only 678 bags of luggage remain aboard. How many bags of luggage did the plane initially carry?"}
{"question": "A boat carrying fish runs aground. By the time the boat is freed, 7890 pounds of fish have escaped into the sea. Only 210 pounds of fish remain on the boat. How many pounds of fish did the boat start with?"}
{"question": "A container ship encounters a storm and leaks. By the time the ship is secured, 45678 gallons of oil have spilled into the ocean. Only 1234 gallons of oil remain in the tank. How many gallons of oil did the ship originally hold?"}
{"question": "A delivery van full of packages crashes into a pole. By the time the van is repaired, 23456 packages have spilled onto the street. Only 345 packages remain in the van. How many packages did the van originally contain?"}
{"question": "A ferry carrying passengers capsizes during a storm. By the time it is righted, 8765 passengers have been rescued. Only 123 passengers remain onboard. How many passengers did the ferry originally carry?"}
{"question": "A cargo helicopter loses its load while flying. By the time it lands safely, 234 tons of equipment have fallen off. Only 56 tons of equipment remain attached. How many tons of equipment did the helicopter initially transport?"}
{"question": "To complete a request, the factory produced 45730 yards of blue cotton and 36200 yards of yellow cotton. How many yards of cotton did it produce for that request?"}
{"question": "To satisfy a demand, the manufacturer painted 12345 yards of fabric red and 67890 yards of fabric blue. What is the total amount of fabric dyed for that demand?"}
{"question": "In order to fulfill a contract, the textile mill dyed 24500 yards of white wool and 39000 yards of black wool. How many yards of wool did it dye for that contract?"}
{"question": "For an order, the company colored 32000 yards of polyester purple and 15000 yards of polyester orange. How many yards of polyester did it color in total for that order?"}
{"question": "To meet production needs, the factory dyed 53000 yards of linen brown and 62900 yards of linen beige. What is the total amount of linen dyed for those production needs?"}
{"question": "To fill a delivery, the workshop dyed 41230 yards of satin silver and 58770 yards of satin gold. How many yards of satin were dyed in total for that delivery?"}
{"question": "In response to a request, the factory dyed 21000 yards of nylon aqua and 32000 yards of nylon coral. How many yards of nylon did it dye for that request?"}
{"question": "To fulfill an order, the workshop dyed 15000 yards of canvas navy and 23400 yards of canvas olive. How many yards of canvas did it dye in total for that order?"}
{"question": "A global company has 1234 temporary workers and 45789 permanent staff members. What is the total number of employees in the company?"}
{"question": "An international firm employs 3450 casual laborers and 78901 regular workers. How many people are employed by the firm?"}
{"question": "A worldwide organization consists of 678 part-time staff and 91234 full-time staff. How many employees does this organization have?"}
{"question": "A foreign corporation has 4321 freelance employees and 23456 full-time employees. What is the overall employee count for the corporation?"}
{"question": "An overseas business employs 876 part-time personnel and 101112 full-time personnel. How many total employees work for this business?"}
{"question": "A large multinational company has 2357 adjunct employees and 56789 salaried workers. What is the total number of employees within the company?"}
{"question": "An international enterprise boasts 999 contract workers and 88888 permanent employees. What is the total workforce size of the enterprise?"}
{"question": "A renowned corporation has 1500 seasonal workers and 65432 core employees. How many employees are there in total at this corporation?"}
{"question": "Every season, ducks migrate south, returning from their breeding grounds. This year, 52345 male ducks and 31259 female ducks flew to their winter habitat. How many ducks completed the migration?"}
{"question": "Each year, turtles hatch on the shores of their ancestral beaches. This year, 15000 male turtles and 7800 female turtles made their way to the ocean. How many turtles started their journey?"}
{"question": "Every spring, butterflies travel to their summer feeding grounds. This year, 34000 male butterflies and 23000 female butterflies emerged from their wintering sites. How many butterflies undertook the journey?"}
{"question": "Annually, wildebeests cross the plains to migrate to greener pastures. This year, 97000 male wildebeests and 48000 female wildebeests joined the migration. How many wildebeests participated in the trek?"}
{"question": "Each fall, geese fly south for the winter. This year, 89000 male geese and 60000 female geese took to the skies. How many geese made the migration?"}
{"question": "Every year, crabs travel to spawn in the bays. This year, 24000 male crabs and 8800 female crabs crawled back to the water. How many crabs returned for spawning?"}
{"question": "Each year, horseflies move to cooler regions as summer ends. This year, 120000 male horseflies and 56000 female horseflies swarmed to their new locations. How many horseflies migrated?"}
{"question": "Every year, frogs hop to their breeding ponds after hibernation. This year, 35000 male frogs and 25000 female frogs returned to the ponds. How many frogs went back to breed?"}
{"question": "A shoe manufacturer has a stock of 10084 shoes for men. Additionally, it has 3290 shoes for women. What is the total number of shoes available overall?"}
{"question": "A toy company possesses 8472 toy cars for boys. Moreover, it has 2765 toy cars for girls. How many toy cars are there in total?"}
{"question": "A bookstore has 25234 novels for adults. Furthermore, it has 10876 novels for children. How many novels are available combined?"}
{"question": "An electronics retailer has 15438 laptops available for students. In addition, it offers 6120 laptops for professionals. What is the total number of laptops available?"}
{"question": "A gym has 1200 fitness classes scheduled for men. Besides that, it has 540 fitness classes for women. How many fitness classes are scheduled overall?"}
{"question": "A bakery produces 3000 loaves of bread for sale. Additionally, it bakes 1250 pastries for customers. What is the total amount of baked goods available?"}
{"question": "A record label has 5000 CDs available for pop music. Furthermore, it has 2000 CDs for rock music. How many CDs are there in total?"}
{"question": "A clothing store has 7600 shirts for men in its inventory. In addition to that, it has 4300 shirts for women. What is the overall availability of shirts?"}
{"question": "Prior to the last economic surge, there were 500 apartments in Maple Town. Currently, there are 800 apartments. How many apartments did builders construct during the economic surge?"}
{"question": "Before the recent construction wave, the village had 300 cottages. Now, there are 450 cottages. What is the number of cottages that were built during the construction wave?"}
{"question": "Before the recent development project, there were 1500 condos in the city. Now, there are 2100 condos. How many condos were developed during the project?"}
{"question": "Before the recent real estate expansion, there were 1200 units in the residential area. Currently, there are 1600 units. How many units were added during the expansion?"}
{"question": "Before the latest housing development, there were 2500 townhouses in the neighborhood. Now, there are 3200 townhouses. How many townhouses did developers create during the development?"}
{"question": "Before the last property boom, there were 700 homes in the region. Now, there are 950 homes. How many homes did contractors build during the property boom?"}
{"question": "Prior to the most recent housing initiative, there were 1800 duplexes across the town. Currently, there are 2200 duplexes. How many duplexes were built during the initiative?"}
{"question": "Before the latest urban development, there were 420 houses in the area. Now, there are 620 houses. How many houses did construction teams erect during the urban development?"}
{"question": "A researcher in a biology lab is analyzing plant specimens. 3 specimens contained a total of 9340 leaves. The first specimen contained 4890 leaves. How many leaves were in the second specimen?"}
{"question": "An analyst at a chemical lab is examining fluid samples. 4 samples contained a total of 12500 milliliters. The first sample contained 3500 milliliters. How many milliliters were in the second sample?"}
{"question": "A student in an agricultural lab is testing soil samples. 5 samples had a combined weight of 5500 grams. The first sample weighed 1200 grams. How much did the second sample weigh?"}
{"question": "An engineer at a materials lab is measuring metal pieces. 6 pieces had a total length of 500 meters. The first piece was 90 meters long. How long was the second piece?"}
{"question": "A technician at a waste management facility is sorting garbage bins. 2 bins contained a total of 800 kg of waste. The first bin had 300 kg of waste. How much waste was in the second bin?"}
{"question": "A biologist is studying microorganisms in a lab. 3 cultures contained a total of 4000 bacteria. The first culture had 1500 bacteria. How many bacteria were in the second culture?"}
{"question": "An astronomer is counting stars in a telescope survey. 2 star clusters contained a total of 8200 stars. The first cluster had 4500 stars. How many stars were in the second cluster?"}
{"question": "A chemist in a lab is mixing solutions. 3 solutions had a total volume of 250 liters. The first solution had 80 liters. How much volume did the second solution have?"}
{"question": "A bakery has produced a total of 4800 pastries this week. If they have made 2130 chocolate pastries, how many other pastries have been made so far?"}
{"question": "A farm has harvested a total of 12500 vegetables this month. If they have gathered 4500 tomatoes, how many other types of vegetables have been harvested?"}
{"question": "A library has checked out a total of 5600 books this month. If they have lent out 2150 fiction books, how many non-fiction books have been checked out?"}
{"question": "A café has served a total of 3000 cups of coffee this week. If they have sold 1800 espresso drinks, how many cups of other types of coffee have been served?"}
{"question": "Last week, the value of Tom's investment dropped by $25. If his investment was valued at $800 beforehand, what is it worth now?"}
{"question": "Recently, Jenny's savings account balance fell by $50. If her account had $1200 before this drop, how much is it worth now?"}
{"question": "A few days ago, the value of Alex's stock portfolio decreased by $30. If the portfolio was worth $2000 previously, what is its current worth?"}
{"question": "Last month, the value of Sarah's property declined by $18,000. If the property had been appraised at $350,000, what is its worth now?"}
{"question": "This morning, the value of Chris's car depreciated by $2,500. If the car was worth $15,000 before this depreciation, how much is it worth now?"}
{"question": "Yesterday, the value of Emily's art collection reduced by $1,200. If her collection was valued at $25,000, how much is it worth now?"}
{"question": "Recently, the value of Michael's business dropped by $5,000. If it was worth $100,000 before, what is its current value?"}
{"question": "A couple of days ago, the value of Rachel's electronics decreased by $150. If her electronics collection was worth $2,500, how much is it now?"}
{"question": "The Springfield Spartans scored a total of 812 goals last season. If they scored 345 goals in the first half of the season, how many goals did they score in the second half?"}
{"question": "The Downtown Dolphins hosted a total of 654 events last year. If they hosted 289 events in the first six months, how many events did they host in the latter half of the year?"}
{"question": "The Mountainview Hawks sold 4780 shirts last summer. If they sold 2210 shirts in the first month, how many shirts did they sell in the remaining months?"}
{"question": "The Greenfield Gators ran a total of 135 marathons this year. If they completed 65 marathons in the first quarter, how many marathons did they complete in the following quarters?"}
{"question": "The Lakeside Lions recorded a total of 430 videos last month. If they recorded 178 videos in the first two weeks, how many videos did they record in the last two weeks?"}
{"question": "The Crestview Cougars launched a total of 120 products last year. If they launched 50 products in the first half of the year, how many products did they launch in the second half?"}
{"question": "The City Central Bears organized a total of 590 community events this year. If they organized 220 events in the first four months, how many events did they organize in the remaining months?"}
{"question": "The Riverside Raiders achieved a total of 900 points this season. If they achieved 350 points in the first half of the season, how many points did they achieve in the second half?"}
{"question": "A tree originally had 150 leaves. After a season, it has grown to 475 leaves. How many more leaves does it have now?"}
{"question": "A fish tank initially contained 200 fish. After a few weeks, the count increased to 1200 fish. How many more fish are there now?"}
{"question": "A classroom started with 25 students. After the enrollment period, it grew to 78 students. How many more students are there now?"}
{"question": "A bakery had 50 loaves of bread. After a busy day, it sold 350 loaves. How many more loaves are there now?"}
{"question": "A garden initially had 90 flowers. By the end of the season, the number increased to 310 flowers. How many more flowers are there now?"}
{"question": "A library had 1500 books at the beginning of the year. After a donation, it now has 2500 books. How many more books are there now?"}
{"question": "A phone store began with 100 smartphones in stock. After a sale, they currently have 450 smartphones. How many more smartphones are there now?"}
{"question": "Alex is a park ranger. Last month, he collected a total of 2450 pieces of litter. If he collected 680 pieces of litter from the picnic areas, how many pieces of litter did Alex collect outside the picnic areas?"}
{"question": "Maria is a library assistant. This week, she organized a total of 980 books. If she organized 215 books in the children's section, how many books did Maria organize outside the children's section?"}
{"question": "James is a street cleaner. Over the weekend, he cleared a total of 3120 items from the streets. If he cleared 890 items from parking lots, how many items did James clear outside the parking lots?"}
{"question": "Lisa is a waste management worker. Last Tuesday, she sorted a total of 1845 recyclable items. If she sorted 410 items at the main collection site, how many items did Lisa sort outside the main collection site?"}
{"question": "Ben is a construction site supervisor. This month, he removed a total of 6720 debris pieces. If he removed 1500 debris pieces from the main building, how many debris pieces did Ben remove outside the main building?"}
{"question": "Emma is a restaurant manager. Last night, she served a total of 530 meals. If she served 125 meals in the outdoor area, how many meals did Emma serve inside the restaurant?"}
{"question": "Noah is a wildlife photographer. Throughout the year, he captured a total of 1200 photographs. If he captured 350 photographs in the forest, how many photographs did Noah capture outside the forest?"}
{"question": "In her garden, Mary has 500 flowers, which are either roses or tulips. There are 120 tulips. How many of Mary's flowers are roses?"}
{"question": "In the zoo, there are 320 animals, consisting of lions and tigers. There are 45 tigers. How many of the animals are lions?"}
{"question": "In the classroom, there are 30 students, each wearing either a red or blue shirt. There are 12 students in blue shirts. How many students are wearing red shirts?"}
{"question": "In the library, there are 800 books, which are either fiction or nonfiction. There are 250 nonfiction books. How many of the books are fiction?"}
{"question": "On the farm, there are 150 chickens, either laying or broilers. There are 80 laying hens. How many chickens are broilers?"}
{"question": "In the park, there are 200 benches, either wooden or metal. There are 70 wooden benches. How many benches are metal?"}
{"question": "In the bakery, there are 600 pastries, either cakes or cookies. There are 200 cookies. How many of the pastries are cakes?"}
{"question": "In a warehouse, there are 1000 boxes, containing either electronics or clothing. There are 300 clothing boxes. How many boxes contain electronics?"}
{"question": "Students at Greenfield schools are participating in a book drive. 12000 books have been collected so far. 8500 books were collected from the middle schools, and the rest from the elementary schools. How many books were collected at the elementary schools?"}
{"question": "Students at Riverdale schools are participating in a food drive. 5000 cans have been collected so far. 3200 cans were collected from the high schools, and the rest from the elementary schools. How many cans were collected at the elementary schools?"}
{"question": "Students at Maplewood schools are participating in a toy drive. 3000 toys have been collected so far. 1800 toys were collected from the junior high schools, and the rest from the elementary schools. How many toys were collected at the elementary schools?"}
{"question": "Students at Valley View schools are participating in a fundraiser. 7500 dollars have been raised so far. 4000 dollars were collected from the high schools, and the rest from the elementary schools. How much money was collected at the elementary schools?"}
{"question": "Students at Crestwood schools are participating in a recycling drive. 6200 items have been recycled so far. 4500 items were recycled from the high schools, and the rest from the elementary schools. How many items were recycled at the elementary schools?"}
{"question": "Students at Sunset Ridge schools are participating in a shoe drive. 4500 pairs of shoes have been collected so far. 2900 pairs were collected from the high schools, and the rest from the elementary schools. How many pairs of shoes were collected at the elementary schools?"}
{"question": "Students at Oak Hill schools are participating in a clothing drive. 8000 pieces of clothing have been collected so far. 5000 pieces were collected from the high schools, and the rest from the elementary schools. How many pieces of clothing were collected at the elementary schools?"}
{"question": "Students at Pinecrest schools are participating in a supply drive. 9000 school supplies have been collected so far. 6000 school supplies were collected from the high schools, and the rest from the elementary schools. How many school supplies were collected at the elementary schools?"}
{"question": "A contractor renovated several rooms in a building using a total of 1200 liters of paint. If they applied 300 liters of red paint, how many liters of blue paint did they use?"}
{"question": "An artist mixed some colors for a mural using a total of 4500 milliliters of paint. If they used 500 milliliters of yellow paint, how many milliliters of green paint did they utilize?"}
{"question": "A school decorated its hallways with two colors of paint using a total of 800 gallons. If they utilized 150 gallons of green paint, how many gallons of red paint were used?"}
{"question": "A designer painted several pieces of furniture using a total of 250 cans of paint. If they used 80 cans of black paint, how many cans of white paint did they apply?"}
{"question": "A community project painted local benches using a total of 600 liters of paint. If they needed 200 liters of brown paint, how many liters of natural wood stain did they use?"}
{"question": "A company manufactured a line of toys that were assembled using a total of 9000 units. If they produced 1500 units in red, how many units did they make in blue?"}
{"question": "A global retail chain has a total of 12000 customers. If 1500 of its customers are located in Canada, how many of its customers are from other countries?"}
{"question": "An online streaming service has 5000 subscribers worldwide. If 450 of those subscribers are in Australia, how many subscribers are from other countries?"}
{"question": "A clothing brand reports a total of 8500 customers around the globe. If 600 live in the UK, how many of its customers are from other nations?"}
{"question": "A tech startup has 3000 active users internationally. If 350 of those users reside in Germany, how many users come from other countries?"}
{"question": "An airline company has a total of 20000 passengers. If 2800 passengers are from Brazil, how many passengers are from other countries?"}
{"question": "A software company claims to have 15000 clients globally. If 1200 clients are based in France, how many clients are from other countries?"}
{"question": "A fitness app has a total of 7000 members worldwide. If 800 of them are in India, how many members are in other countries?"}
{"question": "Last year, apple orchards in Springfield harvested 2500 apples. This year, those same orchards harvested 8000 apples. How many more apples did the orchards harvest this year?"}
{"question": "Last quarter, a factory produced 5000 widgets. This quarter, that factory produced 12000 widgets. How many more widgets did the factory produce this quarter?"}
{"question": "Last month, a bakery made 300 loaves of bread. This month, that bakery made 950 loaves. How many more loaves of bread did the bakery make this month?"}
{"question": "Last year, a vineyard in Napa Valley produced 2000 bottles of wine. This year, that vineyard produced 6500 bottles. How many more bottles of wine did the vineyard produce this year?"}
{"question": "Last semester, students at Central High School read 150 books. This semester, those same students read 600 books. How many more books did the students read this semester?"}
{"question": "Last week, a fishing boat caught 100 pounds of fish. This week, that boat caught 400 pounds. How many more pounds of fish did the boat catch this week?"}
{"question": "Last year, a farm in Greenfield produced 900 pumpkins. This year, that farm produced 4000 pumpkins. How many more pumpkins did the farm produce this year?"}
{"question": "Last semester, a college course had 30 registered students. This semester, the same course has 120 registered students. How many more students are registered this semester?"}
{"question": "A gas line in a city ruptured. Before technicians began repairs, 1500 cubic feet of gas escaped into the air. A total of 3700 cubic feet of gas leaked before the line was patched. How many cubic feet of gas leaked while the technicians were repairing the line?"}
{"question": "A pirate unearthed a hidden stash containing a total of 7632 coins. 78 of the coins were gold, and the remainder were silver. How many of the coins were silver?"}
{"question": "An explorer found a mysterious chest filled with a total of 8342 jewels. 120 of the jewels were sapphires, while the others were emeralds. How many of the jewels were emeralds?"}
{"question": "A fisherman discovered a sunken ship holding a total of 9200 pearls. 150 of the pearls were black, and the rest were white. How many of the pearls were white?"}
{"question": "A collector stumbled upon an ancient vault that contained a total of 4820 artifacts. 200 of the artifacts were pottery, and the remaining were sculptures. How many of the artifacts were sculptures?"}
{"question": "An archaeologist uncovered a treasure trove with a total of 6395 relics. 30 of the relics were gold coins, and the balance were silver coins. How many of the relics were silver coins?"}
{"question": "A treasure seeker found a hidden cave filled with a total of 3120 crystals. 45 of the crystals were amethysts, and the rest were quartz. How many of the crystals were quartz?"}
{"question": "A historian came across a cache containing a total of 5890 manuscripts. 60 of the manuscripts were scrolls, and the rest were books. How many of the manuscripts were books?"}
{"question": "An adventurer discovered a trove filled with a total of 7450 gold bars. 90 of the bars were engraved, and the rest were plain. How many of the gold bars were plain?"}
{"question": "Emily and her family enjoy a lot of apple and grape jam, as they eat bagels every morning. Currently, they have a combined total of 4980 grams of jam. If they have 3264 grams of grape jam, how many grams of apple jam do they have?"}
{"question": "Mark and his family consume a lot of orange and raspberry preserves since they have muffins every morning. Right now, they have a combined total of 7124 grams of preserves. If they have 2945 grams of raspberry preserves, how many grams of orange preserves do they have?"}
{"question": "Sarah and her family go through a lot of peach and cherry chutney, since they eat scones every morning. At the moment, they have a combined total of 5830 grams of chutney. If they have 2350 grams of cherry chutney, how many grams of peach chutney do they have?"}
{"question": "Jacob and his family use a lot of blackberry and apricot jelly, as they eat pancakes every morning. Right now, they have a combined total of 4500 grams of jelly. If they have 1780 grams of apricot jelly, how many grams of blackberry jelly do they have?"}
{"question": "Lisa and her family enjoy a lot of cranberry and fig preserves since they eat waffles every morning. Currently, they have a combined total of 8200 grams of preserves. If they have 3650 grams of fig preserves, how many grams of cranberry preserves do they have?"}
{"question": "Tom and his family consume a lot of pomegranate and coconut spread, as they eat crepes every morning. At the moment, they have a combined total of 6000 grams of spread. If they have 2900 grams of coconut spread, how many grams of pomegranate spread do they have?"}
{"question": "Anna and her family use up a lot of kiwi and passionfruit syrup since they eat yogurt every morning. Right now, they have a combined total of 3500 grams of syrup. If they have 1500 grams of passionfruit syrup, how many grams of kiwi syrup do they have?"}
{"question": "While playing a board game, Sarah scored 2456 points. She and her friend together have a total of 4820 points. How many points does Sarah's friend have?"}
{"question": "During a quiz competition, Mike achieved 1789 points. He and his teammate collectively earned 3000 points. How many points does Mike's teammate have?"}
{"question": "While participating in a coding contest, Emma accumulated 890 points. She and her partner together scored 1500 points. How many points does Emma's partner have?"}
{"question": "While racing in a simulation game, Jack earned 4072 points. He and his sibling have a combined score of 7040 points. How many points does Jack's sibling have?"}
{"question": "In a trivia match, Lisa scored 1590 points. She and her colleague have a total score of 2390 points. How many points does Lisa's colleague have?"}
{"question": "While playing a sports video game, Tom attained 2200 points. He and his friend have a total of 4000 points. How many points does Tom's friend have?"}
{"question": "During a chess tournament, Rachel gained 1345 points. She and her opponent together have a total of 2500 points. How many points does Rachel's opponent have?"}
{"question": "While competing in a dance-off, David scored 3121 points. He and his dance partner together achieved 5500 points. How many points does David's dance partner have?"}
{"question": "A landscaping company has planted a total of 1572 trees in a park. Today, they planted 320 trees. How many trees had they planted before today?"}
{"question": "A bakery has sold a total of 2450 pastries this month. Today, they sold 150 pastries. How many pastries had they sold before today?"}
{"question": "A library has checked out a total of 7260 books this year. Today, they checked out 215 books. How many books had they checked out before today?"}
{"question": "A school has collected a total of 1240 donations for a fundraiser. Today, they collected 45 donations. How many donations had they collected before today?"}
{"question": "A gym has recorded a total of 3245 workouts this month. Today, they recorded 55 workouts. How many workouts had they recorded before today?"}
{"question": "A charity has raised a total of $4500 this quarter. Today, they raised $600. How much had they raised before today?"}
{"question": "A restaurant has served a total of 5867 meals this week. Today, they served 200 meals. How many meals had they served before today?"}
{"question": "A factory has produced a total of 10230 units this year. Today, they produced 120 units. How many units had they produced before today?"}
{"question": "Crystal Pond was originally clear because it only had 1500 fish. Now there are 3200 fish, and the pond has become murky. How many more fish are in Crystal Pond now?"}
{"question": "Sunny Meadow was originally bright because it only had 500 flowers. Now there are 1800 flowers, and the meadow has turned vibrant. How many more flowers are in Sunny Meadow now?"}
{"question": "Emerald Bay was originally calm because it only featured 220 rocks. Now there are 750 rocks, and the bay has become rough. How many more rocks are in Emerald Bay now?"}
{"question": "Golden Valley was originally lush because it had only 700 trees. Now there are 2100 trees, and the valley has turned dense. How many more trees are in Golden Valley now?"}
{"question": "Silver Creek was originally clear because it had only 65 frogs. Now there are 290 frogs, and the creek has become noisy. How many more frogs are in Silver Creek now?"}
{"question": "Copper Lake was originally serene because it had only 800 boats. Now there are 2900 boats, and the lake has turned chaotic. How many more boats are in Copper Lake now?"}
{"question": "Ruby Field was originally colorful because it had only 300 berries. Now there are 1200 berries, and the field has turned vibrant. How many more berries are in Ruby Field now?"}
{"question": "Onyx Forest was originally quiet because it had only 450 deer. Now there are 1700 deer, and the forest has become lively. How many more deer are in Onyx Forest now?"}
{"question": "Emily's walk to the library is 1.2 miles and Jake's walk is 0.4 miles. How much longer is Emily's walk than Jake's?"}
{"question": "Sophia's bike ride to the park is 3.5 miles and Liam's bike ride is 1.0 mile. How much longer is Sophia's bike ride than Liam's?"}
{"question": "Ava's run to the grocery store is 2.5 miles and Noah's run is 1.0 mile. How much longer is Ava's run than Noah's?"}
{"question": "Mia's drive to work is 10 miles and Ethan's drive is 6 miles. How much longer is Mia's drive than Ethan's?"}
{"question": "Isabella's commute to the university is 4 miles and Lucas's commute is 2 miles. How much longer is Isabella's commute than Lucas's?"}
{"question": "Charlotte's stroll through the garden is 0.9 miles and Oliver's stroll is 0.3 miles. How much longer is Charlotte's stroll than Oliver's?"}
{"question": "Amelia's jog around the neighborhood is 1.5 miles and Mason's jog is 0.5 miles. How much longer is Amelia's jog than Mason's?"}
{"question": "Ella's trek to the mountain trail is 6 miles and William's trek is 2.5 miles. How much longer is Ella's trek than William's?"}
{"question": "Emily poured 0.5 cup of raisins into a bowl of oatmeal. After that, she added 0.3 cup of cranberries. How many cups of dried fruits did Emily add to the oatmeal in total?"}
{"question": "Michael mixed 0.75 cup of oats into his smoothie. Later, he incorporated 0.25 cup of chia seeds. What is the total amount of ingredients Michael included in the smoothie?"}
{"question": "Sarah sprinkled 0.2 cup of sunflower seeds on her salad. Subsequently, she included 0.5 cup of pumpkin seeds. What is the total volume of seeds Sarah put in the salad?"}
{"question": "Alex is learning to ride a bike, so this weekend he practiced biking 0.25 mile with his sister and another 0.75 mile with his friend. How far did Alex ride in all?"}
{"question": "Maria is training for a marathon, so this weekend she ran 1.2 miles in the park and another 2.3 miles on the track. How far did Maria run in total?"}
{"question": "Jake is learning to swim, so this weekend he swam 0.5 mile in the pool with his coach and another 1.0 mile in the lake with his buddy. What was Jake's total distance swum?"}
{"question": "Lily is preparing for a hiking trip, so this weekend she hiked 1.5 miles on a local trail and another 2.0 miles in the woods. How far did Lily hike altogether?"}
{"question": "Sam is learning to skateboard, so this weekend he skated 0.3 mile at the park and another 0.7 mile in his neighborhood. What is the total distance Sam skated?"}
{"question": "Emma is learning to play tennis, so this weekend she practiced for 0.2 mile on the court with her coach and another 0.8 mile with her dad. How far did Emma practice in total?"}
{"question": "Oliver is training for a cycling event, so this weekend he cycled 5.0 miles on the road and another 3.0 miles on a trail. What is the total distance Oliver cycled?"}
{"question": "Sophie is learning to rollerblade, so this weekend she rollerbladed 0.4 mile around the park and another 1.0 mile through her neighborhood. How far did Sophie rollerblade in total?"}
{"question": "At a cookie-eating contest, Sarah consumed 0.75 cookies before the buzzer sounded; Mike only finished 0.25 cookies. How many more cookies did Sarah eat than Mike?"}
{"question": "In a sandwich-eating race, Tom devoured 1.5 sandwiches before the time limit ended; Lisa managed to eat 0.5 sandwiches. How much more did Tom eat than Lisa?"}
{"question": "During a donut-eating challenge, Alice managed to eat 2.2 donuts before time was called; Bob ate 1.1 donuts. How many more donuts did Alice consume than Bob?"}
{"question": "At a cupcake-eating competition, Jamie completed 3.25 cupcakes before the timer expired; Chris only finished 1.75 cupcakes. How much more did Jamie eat than Chris?"}
{"question": "A chef sliced 1.2 feet off a loaf of bread and 0.8 feet off a baguette. How much more did the chef slice off the loaf than the baguette?"}
{"question": "A gardener trimmed 1.5 inches off a rose bush and 1 inch off a hedge. How much more did the gardener trim off the rose bush than the hedge?"}
{"question": "A carpenter shaved 2.3 cm off a wooden plank and 1.7 cm off a wooden beam. How much more did the carpenter shave off the plank than the beam?"}
{"question": "A tailor removed 3.5 inches from a dress and 2.0 inches from a coat. How much more did the tailor remove from the dress than the coat?"}
{"question": "A painter painted 0.6 square meters off a wall and 0.4 square meters off a door. How much more did the painter paint off the wall than the door?"}
{"question": "A baker cut 1.0 inch off a cake and 0.5 inch off a pie. How much more did the baker cut off the cake than the pie?"}
{"question": "A chef chopped 0.9 inches off a carrot and 0.6 inches off a cucumber. How much more did the chef chop off the carrot than the cucumber?"}
{"question": "A teacher erased 2.5 centimeters from a chalkboard and 1 centimeter from a whiteboard. How much more did the teacher erase from the chalkboard than the whiteboard?"}
{"question": "At Emily's Sports Shop, 0.4 of the items are basketballs and 0.3 are footballs. What fraction of the items are either basketballs or footballs?"}
{"question": "In Mark's Clothing Store, 0.5 of the apparel are shirts and 0.2 are jackets. What fraction of the apparel are either shirts or jackets?"}
{"question": "At Sara's Toy Store, 0.6 of the toys are dolls and 0.15 are action figures. What fraction of the toys are either dolls or action figures?"}
{"question": "At Tom's Bookstore, 0.45 of the books are fiction and 0.35 are non-fiction. What fraction of the books are either fiction or non-fiction?"}
{"question": "At Amy's Coffee Shop, 0.2 of the drinks are espressos and 0.25 are lattes. What fraction of the drinks are either espressos or lattes?"}
{"question": "In Jake's Bike Shop, 0.55 of the bicycles are mountain bikes and 0.25 are road bikes. What fraction of the bicycles are either mountain bikes or road bikes?"}
{"question": "At Lisa's Pet Store, 0.3 of the animals are cats and 0.4 are dogs. What fraction of the animals are either cats or dogs?"}
{"question": "In Kevin's Gourmet Shop, 0.45 of the items are cheeses and 0.2 are cured meats. What fraction of the items are either cheeses or cured meats?"}
{"question": "Maria ran 1.5 miles and then walked 1 mile. How much farther did Maria run than walk?"}
{"question": "Ethan swam 2.25 laps and then rested by floating for 1.5 laps. How much farther did Ethan swim than float?"}
{"question": "Sarah biked 3.2 kilometers and then coasted for 2 kilometers. How much farther did Sarah bike than coast?"}
{"question": "Jake skated 1.8 miles and then glided 1.2 miles. How much farther did Jake skate than glide?"}
{"question": "Liam jogged 4 laps and then walked 3 laps. How much farther did Liam jog than walk?"}
{"question": "Emma hiked 5.5 miles and then took a break by resting for 4 miles. How much farther did Emma hike than rest?"}
{"question": "Olivia sprinted 2.1 kilometers and then walked 1.5 kilometers. How much farther did Olivia sprint than walk?"}
{"question": "A zoologist recorded one bird that was 0.5 foot tall and another bird that was 0.4 foot tall. How much taller was the first bird?"}
{"question": "An ornithologist measured one eagle that was 3 feet wide and another eagle that was 2.5 feet wide. How much wider was the first eagle?"}
{"question": "A herpetologist observed one snake that was 2 meters long and another snake that was 1.5 meters long. How much longer was the first snake?"}
{"question": "An entomologist counted one beetle that was 0.1 inch long and another beetle that was 0.07 inch long. How much longer was the first beetle?"}
{"question": "A marine ecologist examined one dolphin that was 10 feet long and another dolphin that was 8 feet long. How much longer was the first dolphin?"}
{"question": "A botanist measured one plant that was 1.2 feet tall and another plant that was 0.9 feet tall. How much taller was the first plant?"}
{"question": "A biochemist analyzed one molecule that measured 1 nanometer long and another molecule that measured 0.8 nanometers long. How much longer was the first molecule?"}
{"question": "A paleontologist unearthed one dinosaur bone that was 15 feet long and another bone that was 12 feet long. How much longer was the first dinosaur bone?"}
{"question": "Anna's Organic Market purchased 0.25 pound of carrots and 0.25 pound of zucchini. How many pounds of vegetables did Anna's Organic Market buy in total?"}
{"question": "Michael's Salad Bar acquired 0.5 pound of cucumbers and 0.5 pound of tomatoes. What is the total weight of vegetables Michael's Salad Bar bought?"}
{"question": "Sophia's Vegan Deli obtained 0.4 pound of spinach and 0.6 pound of kale. How many pounds of greens did Sophia's Vegan Deli purchase altogether?"}
{"question": "Jake's Fruit and Veg bought 0.2 pound of broccoli and 0.3 pound of eggplant. How many pounds of vegetables did Jake's Fruit and Veg buy in all?"}
{"question": "Liam's Healthy Kitchen acquired 0.1 pound of onions and 0.9 pound of peppers. What is the total weight of vegetables Liam's Healthy Kitchen purchased?"}
{"question": "Olivia's Fresh Produce collected 0.15 pound of beets and 0.35 pound of radishes. What is the total weight of produce Olivia's Fresh Produce bought?"}
{"question": "Ethan's Green Grocer bought 0.5 pound of asparagus and 0.5 pound of Brussels sprouts. How many pounds of vegetables did Ethan's Green Grocer purchase in total?"}
{"question": "Mia's Plant-Based Bistro purchased 0.2 pound of artichokes and 0.8 pound of mushrooms. What is the total weight of vegetables Mia's Plant-Based Bistro bought?"}
{"question": "Liam has 3 cats. Each day, 1 cat eats 0.2 scoop of cat food and the other two cats eat 0.2 scoop each. Together, how much cat food do the 3 cats eat each day?"}
{"question": "Sophia owns 4 rabbits. Each day, 1 rabbit eats 0.15 scoop of rabbit food and the other rabbits eat 0.15 scoop each. Together, how much rabbit food do the 4 rabbits eat each day?"}
{"question": "James takes care of 5 birds. Each day, 1 bird eats 0.3 scoop of bird food and the other birds eat 0.3 scoop each. Together, how much bird food do the 5 birds eat each day?"}
{"question": "Olivia has 2 fish. Each day, 1 fish eats 0.05 scoop of fish food and the other fish eats 0.05 scoop. Together, how much fish food do the 2 fish eat each day?"}
{"question": "Ethan owns 3 hamsters. Each day, 1 hamster eats 0.1 scoop of hamster food and the other hamsters eat 0.1 scoop each. Together, how much hamster food do the 3 hamsters eat each day?"}
{"question": "Mia has 2 guinea pigs. Each day, 1 guinea pig eats 0.2 scoop of guinea pig food and the other guinea pig eats 0.2 scoop. Together, how much guinea pig food do the 2 guinea pigs eat each day?"}
{"question": "Noah has 4 turtles. Each day, 1 turtle eats 0.4 scoop of turtle food and the other turtles eat 0.4 scoop each. Together, how much turtle food do the 4 turtles eat each day?"}
{"question": "Emily baked a cake using 1.5 cups of flour. Later, she added 0.5 cups more. How much flour did she use in total?"}
{"question": "Jason filled a tank with 3 liters of fuel. Later, he used 1 liter for his car. How much fuel is left in the tank?"}
{"question": "Sophie poured 2.5 cups of rice into a pot. Later, she removed 0.5 cups. How much rice is in the pot now?"}
{"question": "Michael bought a bag of 10 oranges. Later, he ate 2 oranges. How many oranges does he have left?"}
{"question": "Sarah filled a jug with 6 liters of juice. Later, she served 1.5 liters to her friends. How much juice is remaining in the jug?"}
{"question": "David collected 1.2 pounds of berries. Later, he used 0.3 pounds to make a jam. How many pounds of berries does he have left?"}
{"question": "Laura poured 4.5 gallons of paint into a bucket. Later, she used 1.5 gallons for a project. How much paint is still in the bucket?"}
{"question": "Tom had 5 meters of rope. Later, he cut off 1 meter for a project. How much rope does he have now?"}
{"question": "Emily prepared a fruit salad. She added 0.75 cups of strawberries and 0.5 cups of blueberries. How much more strawberries than blueberries did Emily use?"}
{"question": "Jason cooked a soup. He used 1.2 teaspoons of salt and 0.8 teaspoons of pepper. How much more salt than pepper did Jason use?"}
{"question": "Samantha baked cookies. She included 0.4 ounces of chocolate chips and 0.3 ounces of walnuts. How much more chocolate chips than walnuts did Samantha use?"}
{"question": "Alex made a smoothie. He blended 0.5 liters of milk and 0.25 liters of yogurt. How much more milk than yogurt did Alex use?"}
{"question": "Sophia prepared a salad. She chopped 0.6 cups of lettuce and 0.45 cups of tomatoes. How much more lettuce than tomatoes did Sophia use?"}
{"question": "Liam constructed a model. He utilized 2.5 meters of wood and 1.8 meters of plastic. How much more wood than plastic did Liam use?"}
{"question": "The Johnson family allocates 0.5 of their income on housing costs and additionally 0.3 on utilities. In total, what fraction of their income does the Johnson family spend on essential services?"}
{"question": "The Smiths set aside 0.4 of their savings for vacation plans and another 0.25 for entertainment expenses. What fraction of their savings do the Smiths use for leisure activities?"}
{"question": "The Garcia household invests 0.7 of their budget on education and another 0.1 on school supplies. Altogether, what fraction of their budget is spent on educational needs by the Garcia family?"}
{"question": "The Lee family spends 0.3 of their income on childcare and another 0.4 on household supplies. In total, what fraction of their income does the Lee family allocate for family care?"}
{"question": "The Kim family uses 0.6 of their funds for transportation and 0.2 for parking fees. What fraction of their total funds does the Kim family devote to travel expenses?"}
{"question": "The Brown family devotes 0.5 of their budget to home repairs and an additional 0.3 to insurance. What fraction of their budget does the Brown family spend on home-related costs?"}
{"question": "The Patel family spends 0.55 of their funds on health insurance and another 0.25 on medical expenses. Altogether, what fraction of their funds is utilized for health services by the Patel family?"}
{"question": "The White family sets aside 0.4 of their income for clothing and an additional 0.2 for grooming essentials. In total, what fraction of their income does the White family dedicate to personal care?"}
{"question": "In Ms. Johnson's science class, 0.6 of the students received A's and 0.3 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Mr. Smith's English class, 0.5 of the students received A's and 0.4 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Mrs. Davis's history class, 0.8 of the students received A's and 0.1 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Mr. Lee's art class, 0.9 of the students received A's and 0.05 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Ms. Taylor's music class, 0.3 of the students received A's and 0.4 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Mr. White's physical education class, 0.65 of the students received A's and 0.25 received B's. What fraction of the students received either A's or B's?"}
{"question": "In Mrs. Clark's computer science class, 0.75 of the students received A's and 0.2 received B's. What fraction of the students received either A's or B's?"}
{"question": "There is 0.25 cup of sugar in James's bowl. If James adds 0.75 cup more, how much sugar will be in the bowl?"}
{"question": "There is 0.5 cup of flour in Maria's jar. If Maria adds 1.5 cups more, how much flour will be in the jar?"}
{"question": "There is 0.2 cup of water in Alex's pitcher. If Alex adds 0.8 cup more, how much water will be in the pitcher?"}
{"question": "There is 0.3 cup of rice in Lily's container. If Lily adds 0.7 cup more, how much rice will be in the container?"}
{"question": "There is 0.4 cup of honey in Tom's bottle. If Tom adds 0.6 cup more, how much honey will be in the bottle?"}
{"question": "There is 0.1 cup of vinegar in Zoe's bowl. If Zoe adds 0.9 cup more, how much vinegar will be in the bowl?"}
{"question": "There is 0.12 cup of chocolate chips in Ben's cup. If Ben adds 0.88 cup more, how much chocolate chips will be in the cup?"}
{"question": "There is 0.05 cup of salt in Emma's shaker. If Emma adds 0.95 cup more, how much salt will be in the shaker?"}
{"question": "Every morning, the lion at the safari park consumes 1.5 buckets of meat and 0.5 buckets of bones. How many buckets of food does the lion eat each day?"}
{"question": "Each afternoon, the penguin at the aquarium eats 0.3 bucket of krill and 0.6 bucket of fish. How many buckets of food does the penguin consume daily?"}
{"question": "0.6 of the students in the orchestra are in the violin section. 0.2 of the students in the orchestra are in the cello section. What fraction of the students in the orchestra are in either the violin section or the cello section?"}
{"question": "0.3 of the athletes in the team are in the basketball section. 0.15 of the athletes in the team are in the soccer section. What fraction of the athletes in the team are in either the basketball section or the soccer section?"}
{"question": "0.7 of the employees in the office are in the marketing department. 0.1 of the employees in the office are in the sales department. What fraction of the employees in the office are in either the marketing department or the sales department?"}
{"question": "0.4 of the animals in the zoo are in the reptile exhibit. 0.2 of the animals in the zoo are in the bird exhibit. What fraction of the animals in the zoo are in either the reptile exhibit or the bird exhibit?"}
{"question": "0.5 of the visitors in the museum are in the ancient history section. 0.25 of the visitors in the museum are in the modern art section. What fraction of the visitors in the museum are in either the ancient history section or the modern art section?"}
{"question": "0.55 of the participants in the competition are in the cooking category. 0.2 of the participants in the competition are in the baking category. What fraction of the participants in the competition are in either the cooking category or the baking category?"}
{"question": "Tom discovered 3 sticks in the park and measured them with a tape. 1 stick was 1.5 feet long. The other stick was 0.4 feet long. How much longer was the longer stick?"}
{"question": "Lisa found 4 pumpkins in her garden and weighed them on a scale. 1 pumpkin was 2.3 pounds. The other pumpkin was 0.5 pounds. How much heavier was the heavier pumpkin?"}
{"question": "Mark collected 5 leaves in the forest and examined their sizes. 1 leaf was 7 inches wide. The other leaf was 2 inches wide. How much wider was the wider leaf?"}
{"question": "Sara picked 2 apples from the orchard and weighed them on a kitchen scale. 1 apple was 0.6 kilograms. The other apple was 0.2 kilograms. How much heavier was the heavier apple?"}
{"question": "James found 3 coins on the sidewalk and inspected their diameters with a caliper. 1 coin was 1 inch across. The other coin was 0.25 inch across. How much larger was the larger coin?"}
{"question": "In 2 weeks, Sarah's family consumed 0.3 carton of almond milk and 0.2 carton of coconut milk. How much milk did they drink in total?"}
{"question": "During a month, Tom's family used 1.2 cartons of cow's milk and 0.8 cartons of oat milk. What is the total amount of milk they drank?"}
{"question": "Over the course of 3 weeks, Lucy and her family had 0.6 carton of goat milk and 0.4 carton of hazelnut milk. How much milk did they consume in all?"}
{"question": "In a week, Jacob's family drank 0.7 carton of rice milk and 0.3 carton of skim milk. What is the total amount of milk they consumed?"}
{"question": "In 10 days, Emma's family consumed 0.4 carton of buttermilk and 0.5 carton of macadamia milk. How much milk did they drink altogether?"}
{"question": "Michael visited the barber and had 0.25 inch of his hair trimmed. The following day, he returned and requested an additional 0.75 inch to be cut. What total length of hair was cut from him?"}
{"question": "Sophia went to the hairdresser and had 0.5 inch of her hair clipped. The next day, she came back and asked for another 0.25 inch to be removed. How much hair did she end up having cut?"}
{"question": "Daniel stopped by the salon and got 0.2 inch of his hair shortened. The day after, he went again and asked for 0.3 inch more to be taken off. How much hair has he cut in total?"}
{"question": "Lisa went to her stylist and had 0.4 inch of hair cut off. The next day, she returned for another 0.6 inch of hair to be cut. What is the total amount of hair cut from her?"}
{"question": "Matthew went to the barber and had 1 inch of hair chopped off. The next day, he decided to get another 0.3 inch removed. How much hair has he had cut altogether?"}
{"question": "Ella visited the salon and had 0.8 inch of her hair snipped. The following day, she came back for another 0.2 inch cut. What total length of hair was cut from her?"}
{"question": "In Thomas's building, 0.25 of the units are studios and 0.5 are one-bedroom units. What fraction of the units are either studios or one-bedroom units?"}
{"question": "At Lily's residential complex, 0.2 of the apartments are three-bedroom and 0.4 are two-bedroom apartments. What fraction of the apartments are either three-bedroom or two-bedroom apartments?"}
{"question": "In Kevin's housing development, 0.15 of the homes are townhouses and 0.35 are single-family homes. What fraction of the homes are either townhouses or single-family homes?"}
{"question": "At Michelle's apartment complex, 0.1 of the apartments are penthouses and 0.45 are one-bedroom apartments. What fraction of the apartments are either penthouses or one-bedroom apartments?"}
{"question": "In John's student housing, 0.3 of the rooms are shared rooms and 0.2 are private rooms. What fraction of the rooms are either shared or private rooms?"}
{"question": "In Sarah's rental property, 0.5 of the houses are duplexes and 0.1 are bungalows. What fraction of the houses are either duplexes or bungalows?"}
{"question": "In Alex's condo building, 0.4 of the condos are one-bedroom and 0.2 are two-bedroom. What fraction of the condos are either one-bedroom or two-bedroom?"}
{"question": "At Mary’s housing community, 0.6 of the houses are cottage-style homes and 0.2 are modern homes. What fraction of the houses are either cottage-style or modern homes?"}
{"question": "At the park, Alex and his friend both built kites and then measured their lengths. Alex's kite was 1.2 meters long and his friend's was 0.75 meters long. How much longer was Alex's kite than his friend's?"}
{"question": "In the garden, Jamie and her neighbor both grew plants and then measured their heights. Jamie's plant was 2.5 feet tall and her neighbor's was 1.8 feet tall. How much taller was Jamie's plant than her neighbor's?"}
{"question": "In the classroom, Ryan and his classmate both built models and then measured their dimensions. Ryan's model was 3.4 inches wide and his classmate's was 2.5 inches wide. How much wider was Ryan's model than his classmate's?"}
{"question": "At the carnival, Mia and her brother both made cotton candy and then weighed them. Mia's cotton candy weighed 0.6 pounds and her brother's weighed 0.4 pounds. How much heavier was Mia's cotton candy than her brother's?"}
{"question": "On the soccer field, Liam and his teammate kicked footballs and then measured the distances. Liam's kick went 50 yards and his teammate's went 35 yards. How much further did Liam's kick go than his teammate's?"}
{"question": "In the workshop, Sophie and her dad built birdhouses and then measured their heights. Sophie's birdhouse was 4.5 feet tall and her dad's was 3.2 feet tall. How much taller was Sophie's birdhouse than her dad's?"}
{"question": "At the gym, Noah and his friend lifted weights and then recorded the amounts. Noah lifted 150 pounds and his friend lifted 120 pounds. How much more weight did Noah lift than his friend?"}
{"question": "On the track, Emma and her coach timed their runs and then compared their speeds. Emma ran 8.2 miles per hour and her coach ran 7.5 miles per hour. How much faster was Emma's speed than her coach's?"}
{"question": "John started his road trip with 3/4 tank of gas in his vehicle. Upon returning home, he had 1/4 tank left. How much gas did John use?"}
{"question": "Sarah began her delivery shift with 2/3 tank of gas in her van. When she returned to the depot, she had 1/3 tank remaining. How much gas did Sarah use?"}
{"question": "Alex set out for a ride with 1/2 tank of gas in his motorcycle. By the time he got back to the garage, he had 1/6 tank left. How much gas did Alex use?"}
{"question": "Emily started her errands with 5/6 tank of gas in her SUV. When she finished and returned to her house, she had 1/2 tank left. How much gas did Emily use?"}
{"question": "While checking her stock at the coffee shop, Maria notices that she had 1.2 liters of milk yesterday, but the supply is now down to 1.0 liters. How much more milk did Maria have yesterday?"}
{"question": "During a stocktake at the bookstore, John discovers that he had 2.5 copies of a popular novel yesterday, but the count is now down to 2.0 copies. How many more copies did John have yesterday?"}
{"question": "As she checks inventory in her craft store, Emily recognizes that she had 0.8 skeins of yarn yesterday, but now it's down to 0.6 skeins. How much more yarn did Emily have yesterday?"}
{"question": "While auditing the supplies at his hardware store, Paul sees that he had 3.3 cans of paint yesterday, but it has decreased to 3.0 cans. How many more cans of paint did Paul have yesterday?"}
{"question": "While reviewing her ingredient stock at the bakery, Lisa realizes that she had 0.9 kilograms of sugar yesterday, but it's now down to 0.7 kilograms. How much more sugar did Lisa have yesterday?"}
{"question": "In the middle of an inventory check at her clothing store, Sarah finds that she had 5.0 shirts yesterday, but now it's down to 4.5 shirts. How many more shirts did Sarah have yesterday?"}
{"question": "Alice and Bob own adjacent apple orchards. Alice picked 0.5 acre of apples on Tuesday and Bob picked 0.2 acre. How many more acres did Alice pick than Bob?"}
{"question": "Tom and Jerry have neighboring fields of wheat. Tom harvested 0.6 acre of wheat on Wednesday and Jerry harvested 0.3 acre. How many more acres did Tom harvest than Jerry?"}
{"question": "Lucy and Mark have side-by-side grape vineyards. Lucy gathered 0.7 acre of grapes on Thursday and Mark gathered 0.4 acre. How many more acres did Lucy gather than Mark?"}
{"question": "Emma and Liam own bordering strawberry patches. Emma collected 0.8 acre of strawberries on Friday and Liam collected 0.5 acre. How many more acres did Emma collect than Liam?"}
{"question": "Samantha and Noah run adjacent carrot farms. Samantha harvested 0.9 acre of carrots on Saturday and Noah harvested 0.6 acre. How many more acres did Samantha harvest than Noah?"}
{"question": "Isabella and Ethan have neighboring potato fields. Isabella dug up 1.0 acre of potatoes on Sunday and Ethan dug up 0.7 acre. How many more acres did Isabella dig up than Ethan?"}
{"question": "At the bookstore, 0.3 of the books are fiction and 0.4 of the books are non-fiction. What fraction of the books are either fiction or non-fiction?"}
{"question": "In the bakery, 0.2 of the pastries are danishes and 0.6 of the pastries are croissants. What fraction of the pastries are either danishes or croissants?"}
{"question": "At the grocery store, 0.15 of the fruits are apples and 0.35 of the fruits are bananas. What fraction of the fruits are either apples or bananas?"}
{"question": "In the pet store, 0.4 of the animals are dogs and 0.3 of the animals are cats. What fraction of the animals are either dogs or cats?"}
{"question": "At the coffee shop, 0.2 of the drinks are lattes and 0.5 of the drinks are cappuccinos. What fraction of the drinks are either lattes or cappuccinos?"}
{"question": "At the electronics store, 0.25 of the gadgets are tablets and 0.45 of the gadgets are smartphones. What fraction of the gadgets are either tablets or smartphones?"}
{"question": "In the toy store, 0.3 of the toys are action figures and 0.2 of the toys are dolls. What fraction of the toys are either action figures or dolls?"}
{"question": "At the clothing store, 0.5 of the items are shirts and 0.3 of the items are pants. What fraction of the items are either shirts or pants?"}
{"question": "Sarah poured 0.5 liter of orange juice and 0.2 liter of apple juice into a pitcher. How many liters of juice did Sarah pour in total?"}
{"question": "Tim mixed 1.2 cups of quinoa and 0.8 cups of brown rice in a bowl. How many cups of grains did Tim mix altogether?"}
{"question": "Emily baked 0.6 kg of chocolate chips and 0.3 kg of nuts for her cookies. How many kilograms of ingredients did Emily use in total?"}
{"question": "Liam added 0.7 gallons of water and 0.5 gallons of lemonade to a container. How many gallons of liquid did Liam add altogether?"}
{"question": "When Lisa had 2 dogs, she needed to serve 1.5 bowls of dog food each day. Now that Lisa has adopted a third dog, she needs to serve a total of 2.1 bowls each day. How much extra food is needed to feed the third dog?"}
{"question": "When Tom had 3 rabbits, he needed to serve 0.8 kg of rabbit food each week. Now that Tom has adopted a fourth rabbit, he needs to serve a total of 1.2 kg each week. How much extra food is needed to feed the fourth rabbit?"}
{"question": "In Springfield it rained 0.2 inch in the morning and 0.7 inch in the evening. What was the total amount of rainfall?"}
{"question": "In Seattle it drizzled 0.1 inch during the night and 0.4 inch at dawn. What was the total amount of precipitation?"}
{"question": "In Boston it snowed 0.3 inch in the early hours and 0.6 inch by midday. What was the total snowfall?"}
{"question": "In Miami it rained 0.15 inch in the afternoon and 0.5 inch later in the night. What was the total rainfall?"}
{"question": "In Denver it snowed 0.25 inch in the morning and 0.75 inch in the afternoon. What was the total snowfall?"}
{"question": "In Chicago it snowed 0.2 inch in the evening and 0.3 inch before dawn. What was the total amount of snowfall?"}
{"question": "In Phoenix it rained 0.4 inch at noon and 0.1 inch in the evening. What was the total amount of rainfall?"}
{"question": "In Atlanta it snowed 0.3 inch in the late morning and 0.4 inch in the early evening. What was the total snowfall?"}
{"question": "The Johnson family went on a hiking trip in the woods. On the first day, they walked 0.3 mile from their cabin to a lake, then 0.5 mile from the lake to a hilltop. Finally, they trekked 0.2 mile from the hilltop to their campsite. How many miles did the Johnson family walk in total?"}
{"question": "The Smith family embarked on a nature walk in the park. On the first day, they strolled 0.4 mile from their car to a playground, then 0.3 mile from the playground to a picnic area. After that, they walked 0.2 mile from the picnic area to their meeting spot. How many miles did the Smith family stroll altogether?"}
{"question": "The Garcia family went on a day trip to the beach. On their first day, they hiked 0.5 mile from their parking spot to the shoreline, then 0.3 mile from the shoreline to a sand dune. Lastly, they walked 0.2 mile from the sand dune to their umbrella. How many miles did the Garcia family walk in total?"}
{"question": "The Lee family decided to explore a national park. On their first day, they trekked 0.6 mile from their vehicle to a lookout point, then 0.4 mile from the lookout point to a waterfall. Finally, they hiked 0.3 mile from the waterfall to their camp. How many miles did the Lee family trek altogether?"}
{"question": "The Brown family set out for a mountain excursion. On the first day, they hiked 0.4 mile from the parking area to a campsite, then 0.3 mile from the campsite to a rocky outcrop. After that, they wandered 0.2 mile from the outcrop to a nearby pond. How many miles did the Brown family hike in all?"}
{"question": "The White family planned a forest adventure. On the first day, they hiked 0.3 mile from their car to a trailhead, then 0.5 mile from the trailhead to a scenic viewpoint. Finally, they journeyed 0.2 mile from the viewpoint back to their lodge. How many miles did the White family hike overall?"}
{"question": "Before starting her shift, a bartender checks to ensure there is enough tonic for her customers. She finds 0.5 liters at the first table, 0.25 liters at the second table, and 0.75 liters at the third table. Altogether, how many liters of tonic does the bartender find?"}
{"question": "Before starting her shift, a chef ensures there are enough tomatoes for her dishes. She finds 1 kilogram at the first station, 0.5 kilograms at the second station, and 0.75 kilograms at the third station. Altogether, how many kilograms of tomatoes does the chef find?"}
{"question": "Before beginning her shifts, a cashier checks if there is enough change for transactions. She discovers $0.50 at the first drawer, $0.30 at the second drawer, and $0.70 at the third drawer. Altogether, how much change does the cashier find?"}
{"question": "Before her class starts, a teacher checks to see if there are enough notebooks for her students. She finds 5 at the first desk, 10 at the second desk, and 7 at the third desk. Altogether, how many notebooks does the teacher find?"}
{"question": "Before opening the store, a manager checks if there are enough shopping bags for customers. She finds 2 bags at the first shelf, 3 bags at the second shelf, and 1 bag at the third shelf. Altogether, how many shopping bags does the manager find?"}
{"question": "Before starting her shift, a librarian checks if there are enough bookmarks for patrons. She discovers 15 at the first shelf, 10 at the second shelf, and 25 at the third shelf. Altogether, how many bookmarks does the librarian find?"}
{"question": "Before starting his shift, a delivery driver checks to make sure there are enough packages to deliver. He finds 4 boxes in the first truck, 6 boxes in the second truck, and 2 boxes in the third truck. Altogether, how many boxes does the delivery driver find?"}
{"question": "Before beginning her shift, a nurse checks to ensure there are enough bandages for patients. She finds 20 at the first station, 30 at the second station, and 10 at the third station. Altogether, how many bandages does the nurse find?"}
{"question": "A chef stored some unsold cookies in the pantry on Friday evening. They found that there were 0.1 chocolate chip cookies, 0.6 oatmeal raisin cookies, and 0.2 peanut butter cookies. How many cookies did the bakery have left in total?"}
{"question": "A baker placed uneaten muffins into a box on Saturday afternoon. They observed that there were 0.25 blueberry muffins, 0.5 banana muffins, and 0.15 apple muffins. What was the total number of leftover muffins?"}
{"question": "During her trip last winter, Sarah explored San Francisco to collect memorabilia. Initially, she walked 0.1234567890123456 mile from her lodging to a souvenir shop. Next, she strolled 0.9876543210987654 mile from the souvenir shop to a coffee shop and then 0.2222222222222222 mile from the coffee shop back to her lodging. How many miles did Sarah walk in total?"}
{"question": "On his summer trip, John traversed Los Angeles to gather gifts. He first walked 0.4444444444444444 mile from his apartment to a toy store. After that, he walked 0.5555555555555556 mile to a candy shop and then returned 0.3333333333333333 mile back to his apartment. What was the total distance John covered?"}
{"question": "Alex prepared a smoothie for breakfast. He used 0.25 pound of bananas, 0.25 pound of strawberries, and 0.1 pound of yogurt. How many pounds of smoothie did Alex make?"}
{"question": "Jamie baked cookies for the bake sale. She used 0.2 pound of flour, 0.1 pound of sugar, and 0.05 pound of butter. How many pounds of cookies did Jamie make?"}
{"question": "Sam mixed paint for a project. He combined 0.2 pound of red paint, 0.1 pound of blue paint, and 0.05 pound of white paint. How many pounds of paint did Sam mix?"}
{"question": "Taylor created a fruit salad for a picnic. She added 0.15 pound of apples, 0.15 pound of grapes, and 0.1 pound of oranges. How many pounds of fruit salad did Taylor make?"}
{"question": "Jordan made a salad for lunch. He included 0.2 pound of lettuce, 0.1 pound of tomatoes, and 0.05 pound of cucumbers. How many pounds of salad did Jordan make?"}
{"question": "During a toy drive, items were sorted into boxes. The drive resulted in 0.2 box of dolls, 0.3 box of action figures, and 0.5 box of building blocks. Altogether, how many boxes would the toys take up?"}
{"question": "At a book drive, items were organized into stacks. The drive resulted in 0.15 stack of fiction, 0.25 stack of non-fiction, and 0.6 stack of children's books. Altogether, how many stacks would the books take up?"}
{"question": "For a clothing drive, items were placed in bags. The drive collected 0.1 bag of shirts, 0.2 bag of pants, and 0.7 bag of jackets. Altogether, how many bags would the clothing take up?"}
{"question": "During a school supplies drive, items were sorted into containers. The drive resulted in 0.3 container of notebooks, 0.4 container of pens, and 0.3 container of backpacks. Altogether, how many containers would the supplies take up?"}
{"question": "In a pet food drive, items were divided into bins. The drive collected 0.25 bin of dog food, 0.25 bin of cat food, and 0.5 bin of bird food. Altogether, how many bins would the pet food take up?"}
{"question": "At a furniture drive, items were arranged in groups. The drive resulted in 0.15 group of chairs, 0.35 group of tables, and 0.5 group of sofas. Altogether, how many groups would the furniture take up?"}
{"question": "During a recycling event, items were categorized into bags. The event collected 0.2 bag of paper, 0.3 bag of plastic, and 0.5 bag of glass. Altogether, how many bags would the recyclables take up?"}
{"question": "Luna's Tile Studio acquired ceramic tiles from a supplier. The weights of the tiles they acquired were 0.5 ton, 0.5 ton, and 0.25 ton. How many tons of ceramic tiles did Luna's Tile Studio acquire in total?"}
{"question": "Mike's Stone Supply bought slabs of granite from a distributor. The weights of the slabs they bought were 0.4 ton, 0.4 ton, and 0.2 ton. How many tons of granite did Mike's Stone Supply buy in total?"}
{"question": "Sophia's Flooring Solutions imported engineered wood from a manufacturer. The weights of the wood pieces they imported were 0.6 ton, 0.3 ton, and 0.1 ton. How many tons of engineered wood did Sophia's Flooring Solutions import in all?"}
{"question": "Daniel's Stone Works received blocks of limestone from a vendor. The weights of the blocks they received were 0.25 ton, 0.25 ton, and 0.5 ton. How many tons of limestone did Daniel's Stone Works receive altogether?"}
{"question": "Emma's Marble Co. sourced pieces of quartz from a quarry. The weights of the pieces they sourced were 0.75 ton, 0.15 ton, and 0.1 ton. How many tons of quartz did Emma's Marble Co. source in total?"}
{"question": "Jack's Building Materials purchased bricks from a factory. The weights of the bricks they purchased were 0.2 ton, 0.2 ton, and 0.6 ton. How many tons of bricks did Jack's Building Materials purchase in all?"}
{"question": "Olivia's Countertop Creations bought slabs of soapstone from a quarry. The weights of the slabs they bought were 0.1 ton, 0.3 ton, and 0.4 ton. How many tons of soapstone did Olivia's Countertop Creations buy in total?"}
{"question": "Alex's weather station tracked the temperature each day. They recorded 23.5 degrees Celsius on Thursday, 25.0 degrees Celsius on Friday, and 22.0 degrees Celsius on Saturday. What was the total temperature recorded over these days?"}
{"question": "Lisa's math class measured the heights of plants each week. They measured 10.5 centimeters on the first week, 12.0 centimeters on the second week, and 8.5 centimeters on the third week. How many centimeters of plant height did they measure in total?"}
{"question": "James' gym class counted the number of sit-ups each session. They counted 15 sit-ups on Monday, 20 sit-ups on Wednesday, and 10 sit-ups on Friday. What is the total number of sit-ups counted by the class?"}
{"question": "Maria's art class created paintings each month. They painted 3.5 meters of canvas in January, 5.0 meters of canvas in February, and 2.5 meters of canvas in March. How many meters of canvas did they use in total?"}
{"question": "Tom's cooking class prepared various dishes each week. They made 4.2 kilograms of pasta on Monday, 3.5 kilograms of rice on Tuesday, and 2.3 kilograms of vegetables on Wednesday. What is the total weight of the food prepared?"}
{"question": "Sophia's reading club logged the number of books read each month. They read 12 books in January, 15 books in February, and 8 books in March. How many books were read in total?"}
{"question": "Kevin's swimming class recorded the distance swum each practice. They swam 150 meters on Monday, 200 meters on Wednesday, and 100 meters on Friday. What is the total distance swum by the class?"}
{"question": "Ella's music class counted the number of songs practiced each week. They practiced 5 songs on Monday, 8 songs on Wednesday, and 7 songs on Friday. What is the total number of songs practiced by the class?"}
{"question": "A landscaping service purchased 0.25 ton of soil, 0.25 ton of mulch, and 0.75 ton of gravel. How many tons of material did the service purchase in total?"}
{"question": "Emily prepared a smoothie for her sister's birthday celebration. She combined 0.50 gallon of orange juice, 0.25 gallon of apple juice, and 0.10 gallon of yogurt. How many gallons of smoothie did Emily make?"}
{"question": "Michael brewed tea for a family gathering. He used 0.40 gallon of black tea, 0.30 gallon of green tea, and 0.20 gallon of lemonade. How many gallons of tea did Michael brew?"}
{"question": "Jessica created a fruit salad for her colleague's farewell party. She included 0.20 gallon of strawberries, 0.30 gallon of blueberries, and 0.15 gallon of yogurt. How many gallons of fruit salad did Jessica create?"}
{"question": "David mixed drinks for a summer barbecue. He used 0.60 gallon of lemonade, 0.25 gallon of iced tea, and 0.15 gallon of soda. How many gallons of drinks did David mix?"}
{"question": "Sophia concocted a syrup for a pancake breakfast. She used 0.10 gallon of maple syrup, 0.30 gallon of berry syrup, and 0.15 gallon of whipped cream. How many gallons of syrup did Sophia concoct?"}
{"question": "A vehicle drove 1.2 kilometers from City A to City B and 0.3 kilometers from City B to City C. Then it returned 0.3 kilometers from City C back to City A. How many kilometers did the vehicle travel in total?"}
{"question": "An airplane flew 3 miles from Airport A to Airport B and 0.5 miles from Airport B to Airport C. After that, it flew 0.5 miles from Airport C back to Airport A. How many miles did the airplane travel in total?"}
{"question": "A bike rider pedaled 2.5 kilometers from Town X to Town Y and 0.4 kilometers from Town Y to Town Z. Then the rider returned 0.4 kilometers from Town Z back to Town X. What is the total distance traveled by the bike rider?"}
{"question": "A train traveled 4 kilometers from Station 1 to Station 2 and 1 kilometer from Station 2 to Station 3. Then it traveled 1 kilometer back from Station 3 to Station 1. How many kilometers did the train travel in total?"}
{"question": "A hiker walked 1.5 miles from Park A to Park B and 0.2 miles from Park B to Park C. Then the hiker returned 0.2 miles from Park C back to Park A. What is the total distance walked by the hiker?"}
{"question": "A boat sailed 6 nautical miles from Harbor A to Harbor B and 1 nautical mile from Harbor B to Harbor C. Then the boat traveled 1 nautical mile from Harbor C back to Harbor A. How many nautical miles did the boat travel in total?"}
{"question": "A car drove 5 kilometers from Location X to Location Y and 0.6 kilometers from Location Y to Location Z. Finally, it drove 0.6 kilometers back from Location Z to Location X. How many kilometers did the car travel in total?"}
{"question": "A scooter moved 2.8 kilometers from Point A to Point B and 0.7 kilometers from Point B to Point C. After that, it returned 0.7 kilometers from Point C back to Point A. What is the total distance covered by the scooter?"}
{"question": "Mia noted the rainfall each day during a storm. She recorded 0.5 milliliters on Monday, 0.75 milliliters on Tuesday, and 0.25 milliliters on Wednesday. How many total milliliters of rain did Mia record?"}
{"question": "Alex tracked the temperature daily during a heatwave. He recorded 30.5 degrees Celsius on Saturday, 32.0 degrees Celsius on Sunday, and 31.0 degrees Celsius on Monday. What was the total temperature recorded by Alex?"}
{"question": "Samantha observed the humidity levels every day during a summer week. She recorded 70% humidity on Thursday, 75% humidity on Friday, and 80% humidity on Saturday. What was the total percentage of humidity recorded by Samantha?"}
{"question": "James measured the wind speed daily during a storm event. He recorded 15.3 km/h on Tuesday, 20.4 km/h on Wednesday, and 14.8 km/h on Thursday. What was the total wind speed recorded by James?"}
{"question": "Emily documented the hours of sunlight each day during a sunny week. She recorded 8.5 hours on Monday, 9.0 hours on Tuesday, and 7.5 hours on Wednesday. How many total hours of sunlight did Emily document?"}
{"question": "Ryan logged the distances he ran each day during a fitness challenge. He recorded 3.1 kilometers on Monday, 4.2 kilometers on Tuesday, and 2.8 kilometers on Wednesday. What was the total distance that Ryan logged?"}
{"question": "Sophia tracked her daily screen time during a holiday. She recorded 2.5 hours on Saturday, 3.0 hours on Sunday, and 1.5 hours on Monday. What was the total screen time recorded by Sophia?"}
{"question": "During a charity event, Mia sold cupcakes. She sold 0.5 dozen during the morning, 0.75 dozen during lunch, and 0.25 dozen during the afternoon. How many dozens of cupcakes did Mia sell in total?"}
{"question": "At a sports game, Alex managed the soda stand. He dispensed 0.3 liters of soda in the first half, 0.5 liters in the second half, and 0.2 liters in overtime. How many liters of soda did Alex serve altogether?"}
{"question": "In a community picnic, Sam operated the ice cream booth. He scooped 0.1 gallon of vanilla in the first hour, 0.4 gallon of chocolate in the second, and 0.3 gallon of strawberry in the third. How many gallons of ice cream did Sam serve in total?"}
{"question": "During a church fundraiser, Lily organized the cookie table. She distributed 0.6 tray of cookies in the morning, 0.8 tray in the afternoon, and 0.1 tray in the evening. How many trays of cookies did Lily share altogether?"}
{"question": "In a movie night, Ryan controlled the popcorn section. He served 0.2 buckets of popcorn at the start, 0.5 buckets during the intermission, and 0.4 buckets at the end. How many buckets of popcorn did Ryan provide in total?"}
{"question": "At a school carnival, Emma ran the candy booth. She sold 0.15 bag of candy during the first hour, 0.35 bag during the second hour, and 0.5 bag during the third hour. How many bags of candy did Emma sell altogether?"}
{"question": "During a festival, Noah was in charge of the hot chocolate stand. He poured 0.75 cup of hot chocolate in the morning, 0.25 cup in the afternoon, and 0.5 cup in the evening. How many cups of hot chocolate did Noah serve in total?"}
{"question": "A construction project required 0.2 truck-load of gravel, 0.4 truck-load of asphalt, and 0.3 truck-load of brick. How many truck-loads of material were needed in total?"}
{"question": "A landscaping job required 1.5 truck-load of mulch, 2.25 truck-load of topsoil, and 0.75 truck-load of stone. How many truck-loads of material were needed altogether?"}
{"question": "A building renovation required 0.1 truck-load of steel, 0.5 truck-load of wood, and 0.4 truck-load of glass. How many truck-loads of materials were required in total?"}
{"question": "A road repair project needed 0.3 truck-load of concrete, 0.4 truck-load of binder, and 0.2 truck-load of gravel. How many truck-loads of materials were required altogether?"}
{"question": "An infrastructure upgrade required 0.75 truck-load of piping, 1.25 truck-load of sand, and 0.5 truck-load of rocks. How many truck-loads of material were needed in all?"}
{"question": "Lila's art class measured paintbrushes for a project. They discovered that the small brush weighed 0.025 ounces, the medium brush weighed 0.075 ounces, and the large brush weighed 0.1 ounces. What was the total weight of the paintbrushes?"}
{"question": "During a cooking lesson, James's class weighed different ingredients. They found that the flour weighed 1.5 ounces, the sugar weighed 0.75 ounces, and the butter weighed 0.5 ounces. What was the total weight of the ingredients?"}
{"question": "In Mia's band, they weighed various instruments for maintenance. The flute weighed 0.22 pounds, the clarinet weighed 0.32 pounds, and the trumpet weighed 0.45 pounds. What was the total weight of the instruments?"}
{"question": "For their gardening project, Tom's class weighed various seeds. The sunflower seeds weighed 0.5 ounces, the pumpkin seeds weighed 0.25 ounces, and the squash seeds weighed 0.75 ounces. What was the total weight of the seeds?"}
{"question": "Ella's physics class measured different materials for experiments. The metal block weighed 1.2 kilograms, the glass sphere weighed 0.8 kilograms, and the wooden cube weighed 0.5 kilograms. What was the total weight of the materials?"}
{"question": "In Nick's workshop, they weighed tools for organization. The hammer weighed 0.9 pounds, the wrench weighed 0.7 pounds, and the screwdriver weighed 0.2 pounds. What was the total weight of the tools?"}
{"question": "Sara's biology class weighted various specimens for observation. The butterfly weighed 0.01 grams, the beetle weighed 0.02 grams, and the snail weighed 0.03 grams. What was the total weight of the specimens?"}
{"question": "During a math project, Logan's class calculated the weight of different objects. The book weighed 1.5 pounds, the laptop weighed 2.5 pounds, and the notebook weighed 0.3 pounds. What was the total weight of the objects?"}
{"question": "Following the instructions closely, Mia added precisely 0.25 cup of vinegar and 2.5 cups of lemonade. What is the total amount of liquid Mia used?"}
{"question": "By adhering strictly to the guidelines, James measured exactly 0.5 cup of soy sauce and 3 cups of broth. How many cups of liquid did James combine?"}
{"question": "Diligently following the cake recipe, Linda used exactly 0.3333333333333333 cup of milk and 2.6666666666666665 cups of water. What total volume of liquid did Linda incorporate?"}
{"question": "Ryan's physics notebook weighs 3.410 pounds and his algebra notebook weighs 2.100 pounds. How much heavier is the physics notebook than the algebra notebook?"}
{"question": "Jessica's biology textbook weighs 5.200 pounds and her history textbook weighs 4.750 pounds. How much more does the biology textbook weigh than the history textbook?"}
{"question": "Mark's computer science book weighs 8.250 pounds and his literature book weighs 1.500 pounds. What is the difference in weight between the computer science book and the literature book?"}
{"question": "Sophia's art book weighs 1.750 pounds and her music book weighs 0.950 pounds. How much heavier is the art book compared to the music book?"}
{"question": "David's statistics textbook weighs 4.800 pounds and his economics textbook weighs 3.600 pounds. How much more does the statistics textbook weigh than the economics textbook?"}
{"question": "Emma's geography book weighs 2.350 pounds and her physics book weighs 1.900 pounds. How much does the geography book exceed the weight of the physics book?"}
{"question": "Build-It Construction used 12 tons of gravel to construct Mark's driveway and 7.3 tons of gravel to construct Sara's driveway. How much gravel did Build-It Construction use in total?"}
{"question": "City Builders utilized 15 tons of asphalt to resurface John’s road and 6.5 tons of asphalt to resurface Mary’s road. What is the total amount of asphalt used by City Builders?"}
{"question": "Paving Pros deployed 8 tons of concrete to lay down Ryan's path and 4.2 tons of concrete to lay down Emma's path. How much concrete was used by Paving Pros altogether?"}
{"question": "Greenfield Paving Company consumed 9 tons of dirt to extend Kevin's park and 3.8 tons of dirt to extend Emma's park. What is the total dirt consumed by Greenfield Paving Company?"}
{"question": "On a sunny afternoon, Alex filled 2 buckets of sand into a sandbox. Shortly after, he added another 5 buckets. How much sand did Alex put into the sandbox?"}
{"question": "During a picnic, Jamie brought 3 baskets of fruits to share. A little later, she contributed another 7 baskets. How many baskets of fruits did Jamie bring to the picnic?"}
{"question": "On a rainy day, Chris collected 4 jugs of rainwater in a cistern. Moments later, he gathered another 6 jugs. How much rainwater did Chris collect in the cistern?"}
{"question": "At the beach, Taylor brought 2 containers of shells to collect. Soon after, they found another 3 containers. How many containers of shells did Taylor gather at the beach?"}
{"question": "Liam swam 1.75 miles in the morning and 2.5 miles in the afternoon. How many miles did Liam swim in total?"}
{"question": "Sophia read 0.5 books last month and 1.75 books this month. How many books has Sophia read overall?"}
{"question": "Ethan biked 3.25 miles on Saturday and 1.5 miles on Sunday. What is the total distance Ethan biked?"}
{"question": "Emma painted 0.8 canvases in the studio and 1.4 canvases at home. How many canvases did Emma paint in all?"}
{"question": "Noah cooked 2.5 dishes for dinner and 1.3 dishes for lunch. What is the total number of dishes Noah cooked?"}
{"question": "Olivia wrote 0.6 pages of her essay yesterday and 1.9 pages today. How many pages has Olivia written in total?"}
{"question": "Mason completed 4.2 puzzles last week and 3.5 puzzles this week. What is the combined total of puzzles Mason completed?"}
{"question": "A tank holds 5 liters of oil. If Sarah pours in 4.5 liters more, how many liters will there be in total?"}
{"question": "A jug contains 2.5 liters of juice. If John adds 3.2 liters more, how many liters will there be altogether?"}
{"question": "At a barbecue, Jamie and his friends consumed 3.5 gallons of lemonade and 3.5 gallons of iced tea. What is the total amount of beverage they drank?"}
{"question": "During a picnic, Alex and his pals had 4.2 liters of orange juice and 4.2 liters of sparkling water. How much drink did they consume altogether?"}
{"question": "A scientist measured two samples for analysis. The sample of copper weighed 5.25 pounds and the sample of zinc weighed 0.5 pounds. How much heavier was the copper sample than the zinc sample?"}
{"question": "An engineer evaluated two blocks of materials for a project. The block of brass weighed 13.75 pounds and the block of lead weighed 2.25 pounds. What was the weight difference between the brass and the lead block?"}
{"question": "A technician recorded two equipment weights for calibration. The equipment made of titanium weighed 20.5 pounds and the equipment made of magnesium weighed 1.75 pounds. How much greater was the weight of the titanium equipment compared to the magnesium equipment?"}
{"question": "As part of a project on volcanic activity, a geology team is analyzing the eruption history of a nearby volcano. The volcano erupted 2.5 times this past year and 3.5 times the year before. How many times did the volcano erupt in total?"}
{"question": "In a study of glacial movements, a research group is monitoring a local glacier. The glacier advanced 0.75 miles last spring and 1.25 miles the previous spring. How far has the glacier advanced in total?"}
{"question": "During a wildlife observation, a biology class is tracking the migration of a certain bird species. The birds migrated 10 miles this season and 15 miles the season before. What is the total distance the birds migrated?"}
{"question": "As part of a lesson on ocean currents, an oceanography class is studying a specific current's flow. The current flowed 4.0 kilometers last month and 6.5 kilometers the month prior. How far did the current flow in total?"}
{"question": "For an assignment on river erosion, a local environmental group is measuring the erosion rate of a riverbank. The riverbank eroded 3 inches last season and 7 inches the season before. How much did the riverbank erode altogether?"}
{"question": "In a climate study, an environmental science class is calculating the rise in sea levels. The sea level rose 0.3 feet last year and 0.5 feet the year before. How much has the sea level risen in total?"}
{"question": "In a physics class, students are measuring the descent of a falling object. The object fell 12 meters this minute and 8 meters the previous minute. What is the total distance the object has fallen?"}
{"question": "During a construction project, an engineering team is assessing the settlement of a foundation. The foundation settled 2.2 inches last month and 3.8 inches the month before. How much has the foundation settled in total?"}
{"question": "Hoping to win Employee of the Month, John read from 12.5 pages of the manual last week. This week, he reviewed the sections from another 9.3 pages of the same manual. How many pages worth of content did John cover in total?"}
{"question": "Aiming to be the Top Performer, Lisa studied 15.7 pages of the training guide last week. This week, she went over the material from another 6.4 pages of the same guide. What is the total number of pages Lisa studied?"}
{"question": "Aspiring to achieve Best Student award, Mark revised 11.8 pages of his textbook last week. This week, he studied another 4.2 pages from a different chapter of the same textbook. How many pages did Mark review overall?"}
{"question": "Wishing to be recognized as the Employee of the Month, Emma went through 14.1 pages of the report last week. This week, she examined another 7.9 pages from the same report. What is the total number of pages Emma analyzed?"}
{"question": "Determined to be the top candidate, Kevin completed 13.5 pages of the application last week. This week, he finished another 5.5 pages of the same application. How many pages did Kevin complete in total?"}
{"question": "Hoping to earn the title of Best Chef, Anna prepared dishes from 9.8 pages of the cookbook last week. This week, she tried recipes from another 10.1 pages of the same cookbook. What is the total number of pages worth of recipes Anna used?"}
{"question": "Aiming for the title of Sales Leader, Josh called contacts from 16.4 pages of the directory last week. This week, he reached out to people from another 7.7 pages of the same directory. How many pages worth of contacts did Josh reach out to altogether?"}
{"question": "At the park, Liam and his friend both flew kites and then measured their heights. Liam's kite was 4.5 feet tall and his friend's was 3.2 feet tall. How much taller was Liam's kite than his friend's?"}
{"question": "In the garden, Maria and her brother both grew plants and then measured their heights. Maria's plant was 5.75 feet tall and her brother's was 4.0 feet tall. How much taller was Maria's plant than her brother's?"}
{"question": "During the hike, Tom and his cousin both recorded the heights of the trees they saw and then compared them. Tom's tree was 6.1 feet tall and his cousin's was 5.4 feet tall. How much taller was Tom's tree than his cousin's?"}
{"question": "In the classroom, Sarah and her friend both built models and measured their heights. Sarah's model was 2.9 feet tall and her friend's was 1.5 feet tall. How much taller was Sarah's model than her friend's?"}
{"question": "At the festival, Alex and his sister both created sculptures and then measured their heights. Alex's sculpture was 3.2 feet tall and his sister's was 2.0 feet tall. How much taller was Alex's sculpture than his sister's?"}
{"question": "James discovered a blue snail and a yellow snail in his garden. The yellow snail was 5 inches long and the blue snail was 2.5 inches long. How much longer was the yellow snail than the blue snail?"}
{"question": "Emily spotted a red worm and a black worm in her flower bed. The black worm measured 4.5 inches and the red worm was 2 inches long. How much longer was the black worm than the red worm?"}
{"question": "Michael observed a purple lizard and a brown lizard in his backyard. The brown lizard was 6.5 inches long while the purple lizard was 3.25 inches long. How much longer was the brown lizard than the purple lizard?"}
{"question": "Sarah found a striped beetle and a solid beetle in her yard. The solid beetle was 2.8 inches long and the striped beetle measured 1.4 inches. How much longer was the solid beetle than the striped beetle?"}
{"question": "Kevin noticed a white butterfly and a black butterfly in his garden. The black butterfly was 3.5 inches long and the white butterfly was 1.75 inches long. How much longer was the black butterfly than the white butterfly?"}
{"question": "Laura encountered a spotted ladybug and a plain ladybug on her plants. The plain ladybug was 0.9 inches long while the spotted ladybug was 0.4 inches long. How much longer was the plain ladybug than the spotted ladybug?"}
{"question": "Jake discovered a tiny spider and a large spider in the shed. The large spider was 7 inches long while the tiny spider measured 2.3 inches. How much longer was the large spider than the tiny spider?"}
{"question": "Sophia found a pink snail and a green snail in her garden. The green snail was 4 inches long and the pink snail was 1.5 inches long. How much longer was the green snail than the pink snail?"}
{"question": "Alex and his friends consumed 2.5 liters of soda on Wednesday evening and 0.5 liters of soda on Thursday evening. How many liters did they drink in total?"}
{"question": "Sam and her family had 4.75 pizzas on Sunday night and 0.75 pizza on Monday night. How many pizzas did they eat altogether?"}
{"question": "Jordan and his colleagues finished 5.5 bottles of water on Tuesday afternoon and 1 bottle of water on Wednesday morning. How many bottles did they consume in total?"}
{"question": "A gardener began with 10.5 bags of soil. After spending the afternoon planting flowers, she now has 7 bags. How many bags of soil did the gardener use?"}
{"question": "A baker started the day with 15.2 kilograms of flour. After spending the morning making bread, she now has 11 kilograms. How many kilograms of flour did the baker use?"}
{"question": "A teacher started with 5.5 packs of markers. After a busy morning organizing supplies, she now has 3 packs left. How many packs of markers did the teacher use?"}
{"question": "A chef began with 12 liters of sauce. After preparing dishes throughout the day, he now has 8 liters remaining. How many liters of sauce did the chef use?"}
{"question": "Mark just bought a new bookshelf for his living room. The old bookshelf was 4 feet tall and the new bookshelf is 6.5 feet tall. How much taller is the new bookshelf than the old bookshelf?"}
{"question": "Sara recently acquired a new chair for her dining room. The old chair was 3 feet tall and the new chair is 4.75 feet tall. How much taller is the new chair than the old chair?"}
{"question": "Jake just purchased a new table for his kitchen. The old table was 2.5 feet high and the new table is 3.6666666666666665 feet high. How much taller is the new table than the old table?"}
{"question": "Emily just got a new plant stand for her balcony. The old stand was 2 feet tall and the new stand is 3.2 feet tall. How much taller is the new plant stand than the old stand?"}
{"question": "Tom recently added a new dresser to his bedroom. The old dresser was 3.5 feet tall and the new dresser is 5 feet tall. How much taller is the new dresser than the old dresser?"}
{"question": "Lisa just bought a new mirror for her entryway. The old mirror was 4.1 feet tall and the new mirror is 5.8 feet tall. How much taller is the new mirror than the old mirror?"}
{"question": "David just got a new filing cabinet for his office. The old cabinet was 3 feet tall and the new cabinet is 4.25 feet tall. How much taller is the new filing cabinet than the old cabinet?"}
{"question": "Sophia recently purchased a new coat rack for her hallway. The old coat rack was 5 feet tall and the new coat rack is 7.5 feet tall. How much taller is the new coat rack than the old coat rack?"}
{"question": "Liam painted a green stripe that was 12.123456789012345 inches long. Then he painted a red stripe that was 5.987654321098765 inches long. How much longer was the green stripe than the red stripe?"}
{"question": "Sophia wrote a purple line that was 8.444444444444445 inches long. Then she wrote a yellow line that was 4.555555555555555 inches long. How much longer was the purple line than the yellow line?"}
{"question": "Noah measured a black ribbon that was 10.505050505050505 inches long. Then he measured a pink ribbon that was 6.393939393939394 inches long. How much longer was the black ribbon than the pink ribbon?"}
{"question": "Mia drew an orange line that was 9.777777777777779 inches long. Then she drew a gray line that was 2.2222222222222223 inches long. How much longer was the orange line than the gray line?"}
{"question": "Jacob carved a brown stick that was 11.11111111111111 inches long. Then he carved a tan stick that was 3.888888888888889 inches long. How much longer was the brown stick than the tan stick?"}
{"question": "Emma sketched a teal line that was 14.654321098765432 inches long. Then she sketched a violet line that was 7.345678901234568 inches long. How much longer was the teal line than the violet line?"}
{"question": "Aiden drew a gold line that was 13.333333333333334 inches long. Then he drew a silver line that was 6.666666666666667 inches long. How much longer was the gold line than the silver line?"}
{"question": "There are 5.50 liters of juice in Tom's pitcher. If Tom pours in 3 liters more, how many liters will there be in total?"}
{"question": "There are 10.25 pounds of flour in Sarah's pantry. If Sarah buys 4 pounds more, how many pounds will she have altogether?"}
{"question": "There are 12.30 meters of ribbon in Lily's collection. If Lily cuts an additional 5 meters, how many meters will remain in total?"}
{"question": "In January it snowed 1.2 feet. It snowed 0.5 feet less in February than in January. How much did it snow in February?"}
{"question": "In June it poured 2.5 inches. It poured 1.0 inch less in July than in June. How much did it pour in July?"}
{"question": "Sam measured 2 different fruits during a class. The apple weighed 4 pounds and the orange weighed 2.5 pounds. If Sam puts both fruits on the scale at the same time, what will the scale read?"}
{"question": "Lisa weighed 2 books in the library. The first book weighed 1.5 pounds and the second book weighed 3 pounds. If Lisa places both books on the scale at the same time, what will the scale read?"}
{"question": "Jake compared 2 types of cookies in the kitchen. The chocolate cookie weighed 0.8 pounds and the oatmeal cookie weighed 0.5 pounds. If Jake puts both cookies on the scale at the same time, what will the scale read?"}
{"question": "Emily had 2 toy cars during recess. The red car weighed 0.7 pounds and the blue car weighed 1.2 pounds. If Emily places both toy cars on the scale at the same time, what will the scale read?"}
{"question": "Tom weighed 2 different plants for his project. The fern weighed 5.3 pounds and the cactus weighed 2 pounds. If Tom puts both plants on the scale at the same time, what will the scale read?"}
{"question": "Nina calculated the weight of 2 different shoes she found. The left shoe weighed 1.1 pounds and the right shoe weighed 0.9 pounds. If Nina puts both shoes on the scale at the same time, what will the scale read?"}
{"question": "David weighed 2 bags of sand for his experiment. The first bag weighed 12 pounds and the second bag weighed 8 pounds. If David places both bags on the scale at the same time, what will the scale read?"}
{"question": "A squirrel gathered 0.75 pounds of nuts, but birds took away 0.15 pounds of them. How many pounds of nuts are left?"}
{"question": "A farmer harvested 2.10 gallons of milk, but some spilled out, losing 0.30 gallons. How much milk is still available?"}
{"question": "A factory produced 1.50 tons of steel, but an accident caused the loss of 0.20 tons. What is the remaining amount of steel?"}
{"question": "A chef created 10.00 liters of sauce, but during service, 2.50 liters were used. How much sauce is left in total?"}
{"question": "It rained 1.5 inches on Wednesday and 2.3 inches on Thursday. How much rain fell on Wednesday and Thursday combined?"}
{"question": "There were 4.2 gallons of paint used on Saturday and 3.8 gallons on Sunday. What is the total amount of paint used over the weekend?"}
{"question": "David purchased 12.5 liters of milk, and he accidentally spilled 3.7 liters of it on the counter. How much is left?"}
{"question": "Sarah had 15.2 kilograms of flour, and she dropped 4.8 kilograms of it on the ground. How much is remaining?"}
{"question": "John received 20.0 gallons of paint, and he sloshed 6.5 gallons of it onto the driveway. How much is still available?"}
{"question": "Rachel ordered 25.4 meters of fabric, and she tore off 7.9 meters of it while sewing. How much is left over?"}
{"question": "Mike collected 18.6 pounds of coins, and he lost 2.2 pounds of them during the trip. How much does he still have?"}
{"question": "Linda baked 14.1 cookies, and her dog ate 5.0 of them. How many cookies does she have now?"}
{"question": "Tom filled 11.3 cups of water, and he spilled 2.6 cups of it while pouring. How much water remains in the cup?"}
{"question": "A baker purchased 0.25 liters of milk and 0.55 liters of cream. How many liters of dairy products did the baker buy in total?"}
{"question": "A gardener bought 1.2 meters of red fabric and 0.9 meters of blue fabric. How many meters of fabric did the gardener purchase altogether?"}
{"question": "A painter acquired 0.5 gallons of white paint and 0.75 gallons of blue paint. What is the total amount of paint the painter acquired?"}
{"question": "A delivery van carries 10.5 gallons of water and spills 3.2 gallons during transit. What amount of water does the van have upon reaching the destination?"}
{"question": "A bus transports 15.8 passengers to an airport and drops off 5.7 passengers en route. How many passengers remain on the bus when it arrives at the airport?"}
{"question": "Alex was 5.2 feet tall. Then he grew 1.75 feet taller. How tall is Alex now?"}
{"question": "Maria was 3.9 feet tall. Then she grew 2.1 feet taller. How tall is Maria now?"}
{"question": "Sam was 6.0 feet tall. Then he grew 0.5 feet taller. How tall is Sam now?"}
{"question": "Jenna was 4.8 feet tall. Then she grew 1.6 feet taller. How tall is Jenna now?"}
{"question": "A gardener purchased a flower pot that was 12.5 centimeters tall. Then he removed 3.7 centimeters from the bottom. How tall is the flower pot now?"}
{"question": "A tailor bought a piece of fabric that was 5.4 meters long. After cutting 1.8 meters from one end, how long is the piece of fabric left?"}
{"question": "An artist obtained a canvas that measured 15.2 inches wide. He then trimmed 4.5 inches off one side. What is the width of the canvas now?"}
{"question": "A chef received a block of cheese that weighed 2.5 kilograms. After slicing off 0.8 kilograms, what is the weight of the cheese remaining?"}
{"question": "Tom had 58 toy cars, and 12 were broken. Linda purchased 30 of Tom's toy cars. How many toy cars does Tom have now?"}
{"question": "Lila collected 75 pebbles and 30 pieces of driftwood in the park. She gave 20 of the pebbles to Sam. How many pebbles does Lila now have?"}
{"question": "Mark gathered 45 acorns and 15 walnuts in the forest. He shared 10 of the acorns with Emma. How many acorns does Mark have left?"}
{"question": "There are 75 notebooks and 42 pencils on the table. Sarah added 58 notebooks to the table. How many notebooks are now there in total?"}
{"question": "There are 210 books and 145 markers in the shelf. Tom donated 67 books to the shelf. How many books are now there in total?"}
{"question": "There are 300 candies and 250 chocolates in the jar. Emily poured 100 candies into the jar. How many candies are now there in total?"}
{"question": "There are 90 toy cars and 80 action figures in the box. Alex put 20 toy cars in the box. How many toy cars are now there in total?"}
{"question": "There are 50 plants and 30 flowers in the garden. Mia planted 25 flowers in the garden. How many flowers are now there in total?"}
{"question": "There are 500 stickers and 400 stamps in the collection. Liam added 100 stickers to the collection. How many stickers are now there in total?"}
{"question": "There are 120 cookies and 90 brownies on the plate. Zoe baked 50 cookies for the plate. How many cookies are now there in total?"}
{"question": "Mike owned 850 baseball cards, and 12 of them were damaged. Emily purchased 200 of Mike's baseball cards. How many baseball cards does Mike have left?"}
{"question": "Laura started with 420 stamps, and 15 were spoiled. Tom collected 90 of Laura's stamps. What is the current number of stamps Laura has?"}
{"question": "Tom harvested 95 carrots and 102 cucumbers. Lucy harvested 115 carrots. How many carrots did they harvest in total?"}
{"question": "John collected 150 apples and 75 oranges. Sarah collected 200 apples. How many apples did they collect in total?"}
{"question": "Emily grew 140 strawberries and 90 blueberries. Alex grew 160 strawberries. How many strawberries did they grow in total?"}
{"question": "Kevin produced 210 grapes and 130 cherries. Mia produced 145 grapes. How many grapes did they produce in total?"}
{"question": "Anna gathered 230 bananas and 85 kiwis. Jake gathered 190 bananas. How many bananas did they gather in total?"}
{"question": "Mark's university played 720 basketball games this season, 180 of the games were played at home. He attended 310 games. How many basketball games did Mark miss?"}
{"question": "Lisa's college hosted 1,200 soccer matches this year, 300 of the matches were played during the weekend. She participated in 450 matches. How many soccer matches did Lisa miss?"}
{"question": "Jake's team competed in 540 football games this year, 100 of the games were played under lights. He was present at 250 games. How many football games did Jake miss?"}
{"question": "Emily's school organized 950 volleyball games this season, 200 of the games took place indoors. She watched 400 games. How many volleyball games did Emily miss?"}
{"question": "Tom's league conducted 620 hockey games this year, 150 of the games were scheduled at various arenas. He attended 275 games. How many hockey games did Tom miss?"}
{"question": "There are 5 red flowers and 3 yellow flowers in the garden. The gardeners removed 1 yellow flower that was wilting. How many yellow flowers will the garden have when the gardeners are finished?"}
{"question": "There are 8 green apples and 6 red apples in the basket. A child ate 3 green apples. How many green apples will the basket have when the child is finished?"}
{"question": "There are 7 books and 3 notebooks on the shelf. Mark borrowed 2 books from the shelf. How many books are there now?"}
{"question": "Emily has 10 blue marbles and 5 green marbles. She gave away 4 of the blue marbles. How many blue marbles does Emily have now?"}
{"question": "Michael possesses 9 yellow stickers and 3 orange stickers. He lost 2 of the yellow stickers. How many yellow stickers does Michael have now?"}
{"question": "Sarah owns 12 pink flowers and 6 white flowers. She damaged 5 of the pink flowers. How many pink flowers does Sarah have now?"}
{"question": "David has 15 silver coins and 7 gold coins. He spent 6 of the silver coins. How many silver coins does David have now?"}
{"question": "Sofia has 8 green apples and 4 red apples. She ate 3 of the green apples. How many green apples does Sofia have now?"}
{"question": "Liam has 14 chocolate bars and 5 candy canes. He lost 2 of the chocolate bars. How many chocolate bars does Liam have now?"}
{"question": "Sara had 10 apples and 3 oranges in the fruit basket. The birds pecked at 2 of the apples. How many apples does Sara now have?"}
{"question": "There are 50 markers and 30 erasers on the shelf. Alice removed 15 markers from the shelf. How many markers are now on the shelf?"}
{"question": "Jonathan purchased a racing game for $ 15.50, a puzzle game for $ 12.40, and a fantasy game for $ 8.99. Jonathan already has 5 games. How much did Jonathan spend on video games?"}
{"question": "There were 25 books on the shelf and 15 books in the box. Sarah added some books to the shelf today. There are now 40 books on the shelf. How many books did she add to the shelf?"}
{"question": "There were 10 cars in the garage and 5 cars in the driveway. Mike parked some cars in the garage today. There are now 18 cars in the garage. How many cars did he park in the garage?"}
{"question": "There were 12 blue roses and 5 yellow roses in the garden. Mark picked some blue roses from his backyard. There are now 20 blue roses in the garden. How many blue roses did he pick?"}
{"question": "There were 10 green ferns and 4 purple ferns in the pot. Lisa removed some green ferns from her patio. There are now 18 green ferns in the pot. How many green ferns did she remove?"}
{"question": "Emily's dog had puppies and 6 were fluffy. She gave 8 to John and 3 to Sarah. She now has 4 puppies. How many puppies did she have to start with?"}
{"question": "Mark's rabbit had bunnies and 2 were spotted. He gave 5 to Lisa and 3 to Tom. He now has 4 bunnies. How many bunnies did he have to start with?"}
{"question": "Sophia's turtle laid eggs and 3 were white. She gave 4 to Kevin and 2 to Rachel. She now has 1 egg left. How many eggs did she have to start with?"}
{"question": "There are 5 markers in the box and 3 markers on the table. Alex added 2 markers and 4 rulers on the table. How many markers are now there in total?"}
{"question": "There are 10 pencils in the case and 7 pencils on the counter. Jamie placed 3 pencils and 5 erasers on the counter. How many pencils are now there in total?"}
{"question": "There are 12 books on the shelf and 4 books on the desk. Taylor moved 6 books and 2 notebooks to the desk. How many books are now there in total?"}
{"question": "Michael played 5 basketball games this month. He played 6 games last month, and plans to play 4 games next month. He paid 2 dollars for the tickets. How many games will he play in total?"}
{"question": "Lily collected 5 flowers, Mark collected 9 flowers, and Anna collected 6 flowers at the garden. When they counted them, they found that 2 were wilted. How many flowers did they collect together?"}
{"question": "Sam picked 10 apples, Emily picked 4 apples, and Rachel picked 12 apples from the orchard. When they sorted them, they realized that 3 were rotten. How many apples did they pick in total?"}
{"question": "David gathered 7 strawberries, Mia gathered 6 strawberries, and Oliver gathered 9 strawberries from the farm. When they checked them, they noticed that 1 was spoiled. How many strawberries did they gather altogether?"}
{"question": "Chris found 15 coins, Jenny found 10 coins, and Alex found 5 coins in the park. When they examined them, they discovered that 4 were fake. How many coins did they find combined?"}
{"question": "Sarah baked 5 cakes, John baked 11 cakes, and Lucy baked 3 cakes. They worked for 4 days in the bakery. How many cakes did they bake in total?"}
{"question": "Alice has 8 red apples, Bob has 4 red apples, and Charlie has 5 red apples. The apples cost 3 dollars. How many red apples do they have in total?"}
{"question": "Lisa has 10 green marbles, John has 3 green marbles, and Emma has 2 green marbles. The marbles cost 7 dollars. How many green marbles do they have in total?"}
{"question": "Tom has 6 blue cars, Sarah has 5 blue cars, and Mike has 9 blue cars. The cars cost 20 dollars. How many blue cars do they have in total?"}
{"question": "Diana has 15 orange oranges, Peter has 8 orange oranges, and Susan has 12 orange oranges. The oranges cost 2 dollars. How many orange oranges do they have in total?"}
{"question": "Harry has 4 purple pens, Kate has 7 purple pens, and Leo has 5 purple pens. The pens cost 1 dollar. How many purple pens do they have in total?"}
{"question": "Sophia has 3 black cats, Jack has 2 black cats, and Lily has 4 black cats. The cats cost 50 dollars. How many black cats do they have in total?"}
{"question": "There are 45 books and 15 notebooks on the shelf. Maria added 10 books to the shelf. How many books are now there in total?"}
{"question": "There are 30 chairs and 5 tables in the room. John brought in 12 chairs from outside. How many chairs are now in total?"}
{"question": "Jason owns 12 red and 30 yellow marbles. Lisa has 18 red marbles. How many red marbles do they have together?"}
{"question": "Ella has 10 purple and 15 orange candies. Mark possesses 20 purple candies. What is the total number of purple candies they have combined?"}
{"question": "John had 45 comic books, and 10 were damaged. Alex gave John 15 new comic books. How many comic books does John have now?"}
{"question": "Lisa had 27 trading cards, and 5 were bent. Chris gave Lisa 12 new trading cards. How many trading cards does Lisa have now?"}
{"question": "James attended 8 basketball games this season, but skipped 5. He visited 10 games last season and intends to visit 12 games next season. How many basketball games will James attend in total?"}
{"question": "Maria participated in 20 dance classes this month, but missed 4. She took 15 classes last month and plans to take 18 classes next month. How many dance classes will Maria attend in total?"}
{"question": "David joined 6 book clubs this year, but wasn't able to attend 3. He engaged in 5 book clubs last year and hopes to join 7 book clubs next year. How many book clubs will David participate in all?"}
{"question": "There are 25 markers in the box and 15 markers on the table. John added 20 markers and 10 highlighters on the table. How many markers are now there in total?"}
{"question": "There are 60 pencils in the container and 22 pencils on the shelf. Maria placed 18 pencils and 30 crayons on the shelf. How many pencils are now there in total?"}
{"question": "There are 100 stickers in the album and 50 stickers on the board. Kevin arranged 40 stickers and 25 cards on the board. How many stickers are now there in total?"}
{"question": "Alice has 12 blue marbles, Bob has 34 blue marbles, and Charlie has 23 blue marbles. The marbles cost 5 dollars. How many blue marbles do they have in all?"}
{"question": "Lucy has 5 green apples, Mark has 29 green apples, and Sarah has 11 green apples. The apples cost 2 dollars. How many green apples do they have in all?"}
{"question": "Tom has 15 yellow stars, Jerry has 22 yellow stars, and Joyce has 8 yellow stars. The stars cost 3 dollars. How many yellow stars do they have in all?"}
{"question": "Chris has 7 orange oranges, Tony has 18 orange oranges, and Kate has 14 orange oranges. The oranges cost 4 dollars. How many orange oranges do they have in all?"}
{"question": "Emma has 30 white flowers, Liam has 25 white flowers, and Noah has 10 white flowers. The flowers cost 8 dollars. How many white flowers do they have in all?"}
{"question": "Alex collected 50 rocks, Sarah collected 17 rocks, and Tom collected 28 rocks in the park. When they examined them, they found that 12 were broken. How many rocks did they collect together?"}
{"question": "There were 5 blue roses and 3 yellow roses in the pot. Mark picked some blue roses from his garden. There are now 20 blue roses in the pot. How many blue roses did he pick?"}
{"question": "There were 6 green ferns and 2 purple ferns on the shelf. Maria trimmed some green ferns from her backyard. There are now 15 green ferns on the shelf. How many green ferns did she trim?"}
{"question": "There were 3 orange tulips and 5 pink tulips in the garden. Tom sowed some orange tulips from his plot. There are now 12 orange tulips in the garden. How many orange tulips did he sow?"}
{"question": "There were 4 yellow daisies and 1 white daisy in the pot. Linda removed some yellow daisies from her backyard. There are now 10 yellow daisies in the pot. How many yellow daisies did she remove?"}
{"question": "Last month Sarah had 25 dollars and Mike had 50 dollars. Sarah sold some of her crafts and now has 90 dollars. How much money did Sarah make selling crafts?"}
{"question": "There were 15 boxes of toys in the attic and 12 boxes in the garage. Emily added some boxes in the attic today. There are now 45 boxes of toys in the attic. How many boxes did she add in the attic?"}
{"question": "There were 48 books on the shelf and 20 books in the drawer. Mark put more books on the shelf today. There are now 95 books on the shelf. How many books did he put on the shelf?"}
{"question": "There were 50 plants in the garden and 30 plants in the greenhouse. Sarah planted more in the garden today. There are now 95 plants in the garden. How many plants did she plant in the garden?"}
{"question": "There were 70 chairs in the hall and 25 chairs in the janitor's closet. Max brought more chairs to the hall today. There are now 120 chairs in the hall. How many chairs did he bring to the hall?"}
{"question": "There were 40 pencils in the drawer and 20 pencils in the desk. Lucy added some pencils to the drawer today. There are now 85 pencils in the drawer. How many pencils did she add to the drawer?"}
{"question": "There were 55 cups in the cupboard and 30 cups on the shelf. Tom placed more cups in the cupboard today. There are now 100 cups in the cupboard. How many cups did he place in the cupboard?"}
{"question": "There were 25 bottles in the fridge and 10 bottles in the pantry. Anna stocked up and added bottles in the fridge today. There are now 60 bottles in the fridge. How many bottles did she add in the fridge?"}
{"question": "John harvested 10 apples and 5 oranges. Lucy picked 4 apples. How many apples did they gather altogether?"}
{"question": "There are 7 apples and 2 bananas in the basket. Sarah added 3 apples to the basket. How many apples are now there in total?"}
{"question": "There are 10 books and 4 notebooks on the shelf. Emily placed 5 more books on the shelf. How many books are now there in total?"}
{"question": "There are 8 chairs and 6 tables in the room. Mark brought in 2 more chairs. How many chairs are now there in total?"}
{"question": "There are 15 marbles and 7 stones in the jar. Lucy added 4 marbles to the jar. How many marbles are now there in total?"}
{"question": "There are 12 toys and 5 games in the box. Jack put in 3 more toys. How many toys are now there in total?"}
{"question": "Jordan's dog had 5 puppies and 3 had collars. He gave 2 to his neighbors. How many puppies does he now have?"}
{"question": "Sam's rabbit had 6 babies and 4 were white. She gave 3 to a pet store. How many babies does she now have?"}
